{"dogs":{"_model":"Dog","Bull Terrier":{"_id":"58efda91272b281a0cbf1f2d","imageURL":"/images/dogs/bullterrier.jpg","energyLevel":"High","size":"Medium","akcRank":57,"shortDesc":"Playful and charming; sometimes mischievous, always loyal.","breedStandard":"https://www.akc.org/embeds/breed-standard/bull-terrier","grooming":"Their short coats are easy to care for.","exercise":"Very Active; Lots of exercise is needed to prevent boredom and the problem behaviors that come with it.","health":"Bull Terriers are generally a healthy breed.","club":"Bull Terrier Club of America","clubURL":"http://www.btca.com","breed":"Bull Terrier","imageURL2":"/images/dogs/bullterrier2.jpg","function":"Companion","type":"Terrier","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"Bull Terriers can be both independent and stubborn and for this reason are not considered suitable for an inexperienced dog owner. A Bull terrier has an even temperament and is amenable to discipline. Although obstinate, they are particularly good with people. Early socialization will ensure that the dog will get along with other dogs and animals. Their personality is described as courageous, full of spirit, with a fun-loving attitude, a children-loving dog and a perfect family member.","bestOf":{"family":true},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58efda91272b281a0cbf1f2d"},"Airedale Terrier":{"_id":"58e6b040f0077232b8e9f38d","breed":"Airedale Terrier","imageURL":"/images/dogs/airedale-terrier.jpg","imageRef":"","imageTitle":"","imageURL2":"/images/dogs/airedale-terrier2.jpg","energyLevel":"Medium","size":"Medium","akcRank":54,"shortDesc":"Clever, confident, proud. Friendly but courageous.","breedStandard":"https://www.akc.org/embeds/breed-standard/airedale-terrier","club":"Airedale Terrier Club of America, Inc.","clubURL":"http://www.airedale.org/","grooming":"Although relatively easy to maintain, the Airedale coat needs regular brushing and stripping.","groomIcon":"Medium","exercise":"Obedience training is important for these quick learners, but make sure to keep it interesting. They can get bored easily. Airedale Terriers are a high-energy, thinking breed. Apartments are not the right living situation for them. Families with large, fenced yards are ideal.","exerciseIcon":"Medium","health":"Daily exercise is vital to maintain your Airedale Terrier's health.","function":"Working","type":"Terrier","hypoallergenic":false,"shedding":"Low","__v":0,"longDesc":"The Airedale can be used as a working dog and also as a hunting dog. Airedales exhibit some herding characteristics as well, and have a propensity to chase animals. They have no problem working with cattle and livestock. However, an Airedale that is not well trained will agitate and annoy the animals.\nThe Airedale Terrier, like most terriers, has been bred to hunt independently. As a result, the dog is very intelligent, independent, strong-minded, stoic, and can sometimes be stubborn. If children and Airedale are both trained correctly, Airedales can be an excellent choice for a family dog. Airedales can do well with cats and other small animals, especially when they are raised with them.","bestOf":{"apartment":false,"family":false,"active":false,"guard":false,"quiet":false,"lowMaintenance":false},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"th","energyLevelClass":"mdi-run","id":"58e6b040f0077232b8e9f38d"},"Newfoundland":{"_id":"58f0d4378d74eb3d44f44007","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Ohle01.jpg/512px-Ohle01.jpg","energyLevel":"Medium","size":"Large","akcRank":35,"shortDesc":"Sweet, patient, devoted; Newfs are famously good companions","breedStandard":"https://www.akc.org/embeds/breed-standard/newfoundland","grooming":"Regular brushing is important to maintain his plush coat.","exercise":"Somewhat Active; Newfs like using their big, powerful bodies—they need some room to romp. They love pulling things, like kids on sleds, and swimming.","health":"The Newfoundlands is generally a healthy breed.","club":"Newfoundland Club of America, Inc.","clubURL":"http://www.ncanewfs.org","breed":"Newfoundland","imageTitle":"By Peter Ludes, 66507 Reifenberg, Germany (Own work) [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AOhle01.jpg","imageURL2":"/images/dogs/newfie2.jpg","function":"Working","hypoallergenic":false,"shedding":"Profuse","exerciseIcon":"Medium","groomIcon":"High","__v":0,"longDesc":"The Newfoundland is known for its calm and docile nature and its strength. They are highly loyal and make ideal working dogs. It is for this reason that this breed is known as \"the gentle giant.\" International kennel clubs generally describe the breed as having a sweet temper. It typically has a deep bark, and is easy to train if started young. They are wonderfully good with children, but small children can get accidentally leaned on and knocked down. Newfoundlands are ideal companions in the world of therapy and are often referred to as the nanny dog. The breed was memorialized in \"Nana\", the beloved guardian dog in J.M. Barrie's Peter Pan. The Newfoundland in general is good with other animals, but its size can cause problems if it is not trained.","bestOf":{"family":true,"quiet":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run","id":"58f0d4378d74eb3d44f44007"},"American Staffordshire Terrier":{"_id":"58efe3f5272b281a0cbf1f32","imageURL":"/images/dogs/amstaff.jpg","energyLevel":"Medium","size":"Medium","akcRank":81,"shortDesc":"Smart, confident, good-natured companions.","breedStandard":"https://www.akc.org/embeds/breed-standard/american-staffordshire-terrier","grooming":"This breed’s short coat is low-maintenance but will require periodic brushing.","exercise":"Somewhat Active; Versatile and athletic, AmStaffs like mental and physical challenges.","health":"The American Staffordshire Terrier is generally considered a robust and healthy breed.","club":"Staffordshire Terrier Club of America","clubURL":"http://www.amstaff.org","breed":"American Staffordshire Terrier","imageURL2":"images/dogs/amstaff2.jpg","function":"Companion","type":"Terrier","hypoallergenic":false,"shedding":"Low","exerciseIcon":"Medium","groomIcon":"Low","__v":0,"longDesc":"Loyal, fun-loving, fearless and affectionate, American Staffordshire Terriers (sometimes called Amstaffs) bring great joy to their families. Often confused with Pit Bull Terriers, the two breeds share an ancestral bloodline and were originally bred to fight, but the American Staffordshire line has become much more gentle in the last 100 years. Despite their reputation as an aggressive breed, the Amstaff is a true family dog. Loving and playful, this breed will play with children in the yard, then happily snuggle with mom and dad on the couch. Because of the stigma against the breed, some homeowners insurance policies will not cover American Staffordshire Terriers, so potential owners should consult their insurance companies before committing to this dog.","bestOf":{"family":true,"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Orange","ordinal":"st","energyLevelClass":"mdi-run","id":"58efe3f5272b281a0cbf1f32"},"Mastiff":{"_id":"58efdeb1272b281a0cbf1f2f","imageURL":"/images/dogs/englishmastiff.jpg","energyLevel":"Medium","size":"Large","akcRank":28,"shortDesc":"Courageous and dignified, but good-natured and docile.","breedStandard":"https://www.akc.org/embeds/breed-standard/mastiff","grooming":"The breed's short coat needs little maintenance beyond regular weekly grooming with a brush and the occasional bath.","exercise":"They are destined to be very large dogs, so basic obedience training should be a part of every Mastiff's upbringing.","health":"Mastiffs are generally a healthy breed.","club":"Mastiff Club of America, Inc.","clubURL":"http://www.mastiff.org","breed":"Mastiff","imageURL2":"/images/dogs/mastiff.jpg","function":"Working","hypoallergenic":false,"shedding":"Low","exerciseIcon":"Low","groomIcon":"Low","__v":0,"longDesc":"The Mastiff has undergone quite a change over the last 500 years. They were originally bred to be combat dogs, both guarding troops and fighting alongside them. Then they were used in the Roman Coliseum to fight human and animal opponents. In modern times, these massive dogs are wonderful companion animals. They are excellent with children – patient, nurturing, protective, but always up for a romp in the yard, and attach themselves deeply to the people they love. Mastiff owners claim their dogs have no idea just how large they are, and often (hilariously) try to climb on couches and even into the bed for a snuggle. They still make excellent guard dogs, protecting their homes and people with great vigilance, but they are not aggressive. Should they encounter a ne'er-do-well they will hold that person at bay until backup arrives. For families with plenty of room and lots of love to give, the Mastiff makes an excellent family pet.","bestOf":{"family":true,"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run","id":"58efdeb1272b281a0cbf1f2f"},"Shetland Sheepdog":{"_id":"58f0dbff7decb434c07599c3","imageURL":"/images/dogs/sheltie.jpg","energyLevel":"Medium","size":"Medium","akcRank":24,"shortDesc":"Highly intelligent, playful, and energetic","breedStandard":"https://www.akc.org/embeds/breed-standard/shetland-sheepdog","grooming":"The breed's dense double coat requires regular maintenance beyond regular weekly grooming and the occasional bath.","exercise":"Very Active; Shetland Sheepdogs enjoy a good run; tap into their herding heritage with tasked-based exercise for mental stimulation, which this intelligent breed requires.","health":"Shetland Sheepdogs are generally a healthy breed with an average life span of 12 to 14 years.","club":"American Shetland Sheepdog Association","clubURL":"http://www.assa.org","breed":"Shetland Sheepdog","imageURL2":"/images/dogs/sheltie2.jpg","function":"Herding","type":"Shepherd","hypoallergenic":false,"shedding":"Average","exerciseIcon":"High","groomIcon":"Medium","__v":0,"longDesc":"Shelties have a high level of intelligence. According to Dr. Stanley Coren, an expert on animal intelligence, the Shetland sheepdog is one of the brightest dogs, ranking 6th out of 132 breeds tested. His research found that an average Sheltie could understand a new command in less than 5 repetitions and would obey a command the first time it was given 95% of the time or better. They are an all-around family dog who love their families and want to be included in all activities, both outdoors and indoors. They get along well with kids, and enjoy interactive outdoor games. They are often champions in the competitive arena in obedience, agility and herding. For active families who prefer a smaller dog, the Sheltie is an excellent fit.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run","id":"58f0dbff7decb434c07599c3"},"Tibetan Terrier":{"_id":"58efe52d272b281a0cbf1f33","imageURL":"/images/dogs/tibetanterrier.jpg","energyLevel":"Medium","size":"Medium","akcRank":91,"shortDesc":"Affectionate, sensitive, clever, and vocal; TTs are like little people in dog suits.","breedStandard":"https://www.akc.org/embeds/breed-standard/tibetan-terrier","grooming":"Their profuse, thick coat requires weekly maintenance.","exercise":"The athletic heritage of the Tibetan Terrier as a sure footed mountain dog makes them adept in the sport of agility.","health":"Tibetan Terriers are generally a healthy breed with an average lifespan of 12 years.","club":"Tibetan Terrier Club of America, Inc.","clubURL":"http://www.ttca-online.org","breed":"Tibetan Terrier","imageURL2":"/images/dogs/tibetanterrier2.jpg","function":"Companion","type":"Terrier","hypoallergenic":true,"shedding":"No","exerciseIcon":"Medium","groomIcon":"High","__v":0,"longDesc":"The temperament has been one of the most attractive aspects of the breed since it was first established. They are amiable and affectionate family dogs, sensitive to their owners, and gentle with older children if properly introduced. As is fitting for a dog with origins as a watch dog, Tibetans tend to be reserved around strangers, but should never be aggressive nor shy with them. Though not prone to excessive barking, the Tibetan Terrier has an assertive bark.\nSuitable for apartment living, the Tibetan is an energetic and surprisingly strong dog, and needs regular exercise. The energy level of the Tibetan is moderate to high and its general nature is happy, active, lively, intelligent, and agile. As a result, they are well suited for dog sports such as agility. They are steadfast, determined, and clever, which can lead to them being stubborn. Tibetan Terriers are usually charming and loyal. Some dogs of this breed can often be jealous, which can make it hard to live with another pet.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Orange","ordinal":"st","energyLevelClass":"mdi-run","id":"58efe52d272b281a0cbf1f33"},"Akita":{"_id":"58e6b040f0077232b8e9f38e","breed":"Akita","imageURL":"/images/dogs/akita.png","imageRef":"","imageTitle":"","imageURL2":"/images/dogs/akita2.jpg","energyLevel":"Medium","size":"Large","akcRank":47,"shortDesc":"Dignified, courageous, and prfoundly loyal.","breedStandard":"https://www.akc.org/embeds/breed-standard/akita","club":"Akita Club of America, Inc.","clubURL":"http://www.akitaclub.org/","grooming":"Akitas are cat-like in their love of grooming to keep themselves clean.","groomIcon":"Low","exercise":"Akitas do not require the same level of physical activity as other breeds of comparable size. Several brisk walks a day will suffice, and they should be allowed to run a few times a week. Usually too aggressive for dog parks, a fenced-in yard is best.","exerciseIcon":"Medium","health":"Working with responsible breeders, the common health challenges of Akitas may be prevented.","function":"Hunting","type":"Spitz","hypoallergenic":false,"shedding":"Average","__v":0,"longDesc":"The Akita dog breed was originally bred to guard Japanese royalty. Strong and imposing figures, their appearance alone can act as a deterrent to people with ill intent. Affectionate and loving with their families, Akitas can be a rewarding companion, but they have a strong will and a complex personality that can make them a challenge to train. While they do not bark much and are a clean housemate, they can be dominant and strong willed. Akita Inus are not ideal pets for the first-time dog owner. Akitas are among the “banned” breeds that many insurance companies may not cover. Home owners should check their policies and consult with neighborhood associations before adopting an Akita.","bestOf":{"apartment":false,"family":false,"active":false,"guard":true,"quiet":false,"lowMaintenance":false},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run","id":"58e6b040f0077232b8e9f38e"},"Alaskan Malamute":{"_id":"58e6b040f0077232b8e9f38f","breed":"Alaskan Malamute","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Alaskan_Malamute_-_panoramio_-_waga11_%281%29.jpg/512px-Alaskan_Malamute_-_panoramio_-_waga11_%281%29.jpg","imageRef":"https://commons.wikimedia.org/wiki/File%3AAlaskan_Malamute_-_panoramio_-_waga11_(1).jpg","imageTitle":"waga11 [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageURL2":"/images/dogs/alaskan-malamute2.jpg","energyLevel":"High","size":"Large","akcRank":55,"shortDesc":"Affectionate, loyal, playful but dignified.","breedStandard":"https://www.akc.org/embeds/breed-standard/alaskan-malamute","club":"Alaskan Malamute Club of America, Inc.","clubURL":"http://www.alaskanmalamute.org/","grooming":"They have thick coats which shed heavily twice a year.","groomIcon":"Medium","exercise":"Somewhat active. A very strong dog built for heavy work, the big guy craves regular exercise.","exerciseIcon":"Medium","health":"Needs early socialization to people and dogs as well as basic obedience training to grow up to be a well-adjusted, mentally healthy dog.","function":"Sled","type":"Spitz","hypoallergenic":false,"shedding":"Profuse","__v":0,"longDesc":"The Malamute has a long genetic foundation of living in harsh environments, and many of its behaviors have adapted to survive in such environments. Independence, resourcefulness, high intelligence and natural behaviors are common in the breed. Malamutes, like other Northern and sled dog breeds, can have a high prey drive. This may mean in some cases they will chase smaller animals, including other canines, as well as rabbits, squirrels, and cats. So while Malamutes are, as a general rule, particularly amicable around people and can be taught to tolerate smaller pets, it is necessary to be mindful of them around smaller animals and small children. Malamutes are very fond of people, a trait that makes them particularly sought-after family dogs, but unreliable watchdogs. Malamutes are nimble around furniture and smaller items, making them ideal house dogs, provided they get plenty of time outdoors meeting their considerable exercise requirements. If they are year-round outdoor dogs, letting them play in a baby pool filled with cold water in summer keeps them cool. In the winter, they love snow. Malamutes are usually quiet dogs, seldom barking. When a Malamute does vocalize, it often appears to be \"talking\" by vocalizing a \"woo woo\" sound. It may howl like a wolf or coyote, and for the same reason.","bestOf":{"apartment":false,"family":false,"active":false,"guard":false,"quiet":false,"lowMaintenance":false},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58e6b040f0077232b8e9f38f"},"Australian Cattle Dog":{"_id":"58f0dcf87decb434c07599c4","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/ACD_MK_Mishak.JPG/512px-ACD_MK_Mishak.JPG","energyLevel":"High","size":"Medium","akcRank":54,"shortDesc":"Alert, curious, and pleasant.","breedStandard":"https://www.akc.org/embeds/breed-standard/australian-cattle-dog","grooming":"Care of the coat requires only occasional baths and weekly brushing.","exercise":"Very Active; These high-energy dogs need a job to remain happy.","health":"In general, ACDs are sturdy, healthy dogs.","club":"Australian Cattle Dog Club of America","clubURL":"http://www.acdca.org","breed":"Australian Cattle Dog","imageTitle":"By Eva holderegger walser (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AACD_MK_Mishak.JPG","imageURL2":"/images/dogs/cattledog.jpg","function":"Herding","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"Like many working dogs, the Australian Cattle Dog (ACD) has high energy levels, an active mind, and a level of independence, ranking 10th most intelligent dog in  Stanley Coren's \"The Intelligence of Dogs\". The ACD is an affectionate and playful pet. However, it is reserved with people it does not know and naturally cautious in new situations. Its attitude to strangers makes it an excellent guard dog when trained for this task, and it can be socialized to become accustomed to a variety of people from an early age as a family pet. It is good with older, considerate children, but will herd people by nipping at their heels, particularly younger children who run and squeal. By the time puppies are weaned, they should have learned that the company of people is pleasurable, and that responding to cues from a person is rewarding. The bond that this breed can create with its owner is strong and will leave the dog feeling protective towards the owner, typically resulting in the dog's never being too far from the owner's side. The Australian Cattle Dog can be the friendliest of companions although it is quick to respond to the emotions of its owners, and may defend them without waiting for a command. The ACD was originally bred to move reluctant cattle by biting, and it will bite if treated harshly. The Australian Cattle Dog's protective nature and tendency to nip at heels can be dangerous as the dog grows into an adult if unwanted behaviors are left unchecked.","favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58f0dcf87decb434c07599c4"},"Australian Shepherd":{"_id":"58eff240272b281a0cbf1f3c","imageURL":"/images/dogs/aussie.jpg","energyLevel":"High","size":"Medium","akcRank":16,"shortDesc":"Extremely smart, work-oriented, exuberant. Requires a great deal of exercise and attention.","breedStandard":"https://www.akc.org/embeds/breed-standard/australian-shepherd","grooming":"Their thick water-resistant coats require weekly brushing.","exercise":"Australian Shepherds need a lot of physical activity. They are a working breed, so they thrive on learning new tasks and engaging in those tasks as often as possible. Families who are active outdoors will benefit from the company of an Aussie. They are incredibly agile and enjoy games like fetch and catching a frisbee.","health":"Most Aussies are energetic dogs that require vigorous daily exercise to keep them healthy and happy.","club":"United States Australian Shepherd Association","clubURL":"http://www.australianshepherds.org","breed":"Australian Shepherd","imageURL2":"/images/dogs/aussie2.jpg","function":"Herding","type":"Shepherd","hypoallergenic":false,"shedding":"Profuse","exerciseIcon":"High","groomIcon":"High","__v":0,"longDesc":"An Australian shepherd enjoys working, whether it is learning and practicing tricks, competing in dog agility, or engaging in any other physically and mentally involving activity.\nDogs may show reserved and cautious guarding behaviors. They are kind, loving, and devoted to those they know. They are very loyal to their owners, and are rewarding dogs if treated well. Because the breed was developed to serve on the ranch, a job which includes being protective of its property, it is inclined to bark warnings about neighborhood activity, but not inclined toward obsessive barking.\nThe Aussie is intelligent, learns quickly, and loves to play. This means that a bored, neglected, unexercised Aussie may invent its own games, activities, and jobs, which to a busy owner might appear to be hyperactivity. Without something to amuse them, Aussies can become destructive. Aussies also do best with plenty of human companionship: they are often called \"Velcro dogs\" for their strong desire to always be near their owners and for their tendency to form intense, devoted bonds with select people.\nThe Australian Shepherd has a reputation as a highly intelligent and versatile stock dog with a range of working styles. A good working Aussie is quick, thoughtful, and easy with its stock. The ability for the breed to adapt to the situation and to think for itself makes it an excellent all-around worker. For this reason, the Aussie is often chosen to work unusual livestock such as ducks, geese, and commercially raised rabbits.\nThese dogs require a minimum of two to three hours a day of play, exercise, and attention. They thrive in rural, ranch-like conditions, and need space to run and play in an urban setting. The Australian Shepherd is a high-spirited dog, that requires much attention and work. Teaching them tricks keeps them focused and happy, which also keeps their minds working. The breed also has great stamina and can live in a variety of terrain. Because of this, they are popularly used as trail and working dogs.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58eff240272b281a0cbf1f3c"},"Beagle":{"_id":"58efd774272b281a0cbf1f2b","imageURL":"/images/dogs/beagle.png","energyLevel":"Medium","size":"Small","akcRank":5,"shortDesc":"Beagles are loving and lovable, happy, easygoing, and companionable.","breedStandard":"https://www.akc.org/embeds/breed-standard/beagle","grooming":"They have a short, easy-to-care-for coats.","exercise":"Despite their compact size, beagles require a lot of exercise. At first glance they might seem like a good apartment dog, but families who don't have fenced yards for beagles to run in should be sure to walk them and take them to the park regularly in order to keep their weight down and to prevent boredom. Because they were originally bred to be hunting dogs, beagles like to stay active and love being outside. Breeders recommend several long walks a day, plus time for running.","health":"Beagles are generally a healthy breed with a life span between 12 to 15 years.","club":"National Beagle Club","clubURL":"http://clubs.akc.org/NBC/","breed":"Beagle","imageURL2":"/images/dogs/beagle2.jpg","function":"Hunting","type":"Hound","hypoallergenic":false,"shedding":"Average","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"The Beagle has an even temper and gentle disposition. Described in several breed standards as \"merry\", they are amiable and typically neither aggressive nor timid, although this depends on the individual. They enjoy company, and although they may initially be standoffish with strangers, they are easily won over. They make poor guard dogs for this reason, although their tendency to bark or howl when confronted with the unfamiliar makes them good watch dogs. \nBeagles are intelligent but, as a result of being bred for the long chase, are single-minded and determined, which can make them hard to train. They can be difficult to recall once they have picked up a scent, and are easily distracted by smells around them.\nBeagles are excellent with children and this is one of the reasons they have become popular family pets, but they are pack animals, and are prone to separation anxiety, a condition which causes them to destroy things when left unattended. Not all Beagles will howl, but most will bark when confronted with strange situations, and some will bay when they catch the scent of potential quarry. They also generally get along well with other dogs.","bestOf":{"family":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run","id":"58efd774272b281a0cbf1f2b"},"Belgian Malinois":{"_id":"58f1099ccefc5b1678c630ce","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Belgian_Malinois_male_Flickr.jpg/512px-Belgian_Malinois_male_Flickr.jpg","energyLevel":"High","size":"Large","akcRank":47,"shortDesc":"Smart, confident, hardworking, and steadfastly loyal. Needs to be active.","breedStandard":"https://www.akc.org/embeds/breed-standard/belgian-malinois","grooming":"This breed has a double coat that will require regular brushing to keep it in good condition.","exercise":"Very Active; A high-energy worker who demands plenty of exercise.","health":"Belgian Malinois are generally a healthy breed.","club":"American Belgian Malinois Club","clubURL":"http://www.malinoisclub.com","breed":"Belgian Malinois","imageTitle":"By Flickr user intrepidmalinois &quot;MALINUTS&quot; (Flickr here) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons\"https://commons.wikimedia.org/wiki/File%3ABelgian_Malinois_male_Flickr.jpg","imageRef":"\"https://commons.wikimedia.org/wiki/File%3ABelgian_Malinois_male_Flickr.jpg","imageURL2":"/images/dogs/malinois.jpg","function":"Guard","type":"Shepherd","hypoallergenic":false,"shedding":"Average","exerciseIcon":"High","groomIcon":"Medium","__v":0,"longDesc":"Well-raised and trained Malinois are usually active, intelligent, friendly, protective, alert and hard-working. Belgian Malinois exhibit energy levels that are among the highest of all dog breeds. A typical Malinois will have puppy-like energy until the age of three, though it is not uncommon for them to exhibit this energy level until the age of five. Many have excessively high prey drive. Some may be excessively exuberant or playful, especially when young. They can be destructive or develop neurotic behaviors if not provided enough stimulation and exercise. This often causes problems for owners who are unfamiliar with the breed and are not prepared to provide the exercise they require or a job for them to do. They are medium-sized, strong dogs that require consistent obedience training, and enjoy being challenged with new tasks. They are known to be very easy to train, due to their high drive for rewards.","bestOf":{"guard":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58f1099ccefc5b1678c630ce"},"Bernese Mountain Dog":{"_id":"58efe824272b281a0cbf1f34","imageURL":"/images/dogs/bernese.jpg","energyLevel":"Medium","size":"Large","akcRank":27,"shortDesc":"Good-natured and calm. Sweet and affectionate.","breedStandard":"https://www.akc.org/embeds/breed-standard/bernese-mountain-dog","grooming":"As a double-coated breed, they also tend to shed considerably, and require regular brushing.","exercise":"They love outdoor activities, like hiking or even pulling young children in a cart. Bernese are outdoor dogs at heart, though well-behaved in the house; they need activity and exercise, but do not have a great deal of endurance. They can move with amazing bursts of speed for their size when motivated.","health":"The average life span of the Bernese Mountain Dog is between 8 and 11 years.","club":"Bernese Mountain Dog Club of America, Inc.","clubURL":"http://www.bmdca.org","breed":"Bernese Mountain Dog","imageURL2":"/images/dogs/bernese2.jpg","function":"Herding","hypoallergenic":false,"shedding":"Profuse","exerciseIcon":"Medium","groomIcon":"High","__v":0,"longDesc":"Bernese Mountain Dogs are a true family companion. They are sweet, affectionate, easy-going, take well to children and are extremely patient with kids climbing all over them. They have the energy to play all day, and will happily flop down by the fireplace for a little rest and relaxation with the rest of the family. They do just fine with other pets, are polite to strangers and sometimes think they are lapdogs, despite their size. They are excellent guardians. They tend to bond with one owner, and are somewhat aloof and standoffish.\nThis dog’s temperament is naturally cautious and reserved, particularly with people he doesn’t know. In extreme cases, he can become timid and suspicious. To avoid this, make sure you socialize your pup from a young age. \nBerners can be prone to separation anxiety and digging in the yard as a means to find a cooler resting spot.","bestOf":{"active":true,"quiet":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run","id":"58efe824272b281a0cbf1f34"},"Bichon Frise":{"_id":"58e6b040f0077232b8e9f389","breed":"Bichon Frise","imageURL":"https://upload.wikimedia.org/wikipedia/commons/5/58/Honey_Dreams_Dancer_%26_Sahra.jpg","imageTitle":"By Honey Dream&#039;s Monika Sausen (Own work) [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC BY 3.0 (http://creativecommons.org/licenses/by/3.0)], via Wikimedia Commons","imageURL2":"/images/dogs/bichon-frise2.jpg","energyLevel":"Medium","size":"Small","akcRank":45,"shortDesc":"Playful, peppy and curious. Will stick to their owners like velcro.","breedStandard":"https://www.akc.org/embeds/breed-standard/bichon-frise","club":"The Bichon Frise Club of America, Inc.","clubURL":"http://bichon.org","grooming":"Because the Bichon coat is hair and not fur, regular brushing and grooming is required to avoid matting.","groomIcon":"High","exercise":"They don't need too much activity, a few walks a day and a little time to play are all they need. Apartment dwellers can have a happy Bichon since they don't require vigorous exercise.","exerciseIcon":"Medium","health":"Generally a healthy breed, although prone to allergies and skin conditions","function":"Companion","type":"Bichon","hypoallergenic":true,"shedding":"No","__v":0,"longDesc":"The American Kennel Club (AKC) refers to the Bichon Frise as \"merry\" and \"cheerful\", and the breed standard calls for a dog that is \"gentle mannered, sensitive, playful and affectionate\". The Bichon Frise loves human company and demands much of your attention. They are generally very sociable and do well with an owner that takes them along on outings. They are charming, affectionate, and intelligent. Bichons do well with children because they are playful and have lots of energy. If affiliated with a particular territory and encouraged by owners, they can become very territorial. Bred to be companion dogs, the Bichon Frise tends to get along well with both children and other animals. Bichon Frises are very obedient if training is started early and continued constantly.","bestOf":{"apartment":true,"family":false,"active":false,"guard":false,"quiet":true,"lowMaintenance":false},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run","id":"58e6b040f0077232b8e9f389"},"Border Collie":{"_id":"58f0ea1ecefc5b1678c630c5","imageURL":"/images/dogs/bordercollie.jpg","energyLevel":"High","size":"Medium","akcRank":38,"shortDesc":"Remarkably smart workaholics; not averse to a good cuddle.","breedStandard":"https://www.akc.org/embeds/breed-standard/border-collie","grooming":"Border Collies are an active, outdoorsy breed with a long coat which tends to pick up debris throughout its work day.","exercise":"The uncanny intelligence, athleticism, and trainability of Border Collies have a perfect outlet in agility work. They must have at least two hours of activity a day in order to stave off behavioral problems, and the behavioral problems that develop in Border Collies can be severe. Not good for life in an apartment.","health":"Border Collies are generally a healthy and robust breed. The natural life span of the Border Collie is between 10 and 14 years, with an average lifespan of 12 years.","club":"Border Collie Society of America","clubURL":"http://www.bordercolliesociety.com","breed":"Border Collie","imageURL2":"/images/dogs/bordercollie2.jpg","function":"Herding","type":"Shepherd","hypoallergenic":false,"shedding":"Average","exerciseIcon":"High","groomIcon":"Medium","__v":0,"longDesc":"Border collies require considerably more daily physical exercise and mental stimulation than many other breeds. The Border collie is an intelligent dog breed; in fact, it is widely considered to be the most intelligent dog breed. Although the primary role of the Border collie is to herd livestock, this type of breed is becoming increasingly popular as a companion animal.\nIn this role, due to their working heritage, Border collies are very demanding, playful, and energetic. They thrive best in households that can provide them with plenty of play and exercise, either with humans or other dogs. Due to their demanding personalities and need for mental stimulation and exercise, many Border Collies develop problematic behaviors in households that are not able to provide for their needs. They are infamous for chewing holes in walls, furniture such as chairs and table legs, destructive scraping and hole digging, due to boredom. However, being eminently trainable, they can live amicably with other pets if given proper socialization training.\nBefore taking on the breed as a household pet, potential owners should be sure they can provide regular exercise commensurate with the collie's high energy and prodigious stamina. A working collie may run many miles a day, using its experience, personality and intelligence to control challenging livestock, and these dogs will be distressed and frustrated if left in isolation, ignored or inactive. Like many working breeds, Border collies can be motion-sensitive and may chase moving vehicles and bicycles, but this behavior can be modified by training. Some of the more difficult behaviors require patience, as they are developmental and may disappear as the dog matures.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58f0ea1ecefc5b1678c630c5"},"Boxer":{"_id":"58efdc05272b281a0cbf1f2e","imageURL":"/images/dogs/boxer.jpg","energyLevel":"High","size":"Medium","akcRank":10,"shortDesc":"Fun-loving, bright, active and loyal. The Peter Pan of dogs.","breedStandard":"https://www.akc.org/embeds/breed-standard/boxer","grooming":"The Boxer’s short, shiny and smooth-lying coat requires little grooming.","exercise":"Boxers require a lot of vigorous exercise. Long daily walks and plenty of time to run are crucial to keeping a Boxer physically and mentally fit. They should not, however, be exercised too heavily in hot weather as they are prone to heatstroke. They can live in condos or apartments, as long as there is a daily commitment to exercise.","health":"Boxers are generally a healthy breed. The average life span of the Boxer is 11 to 14 years. They are not particularly well-suited to living in climates with temperature extremes.","club":"American Boxer Club, Inc.","clubURL":"http://americanboxerclub.org/","breed":"Boxer","imageURL2":"/images/dogs/boxer2.jpg","function":"Working","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"Boxers are a bright, energetic and playful breed and tend to be very good with children. They are patient and spirited with children but also protective, making them a popular choice for families. They are active, strong dogs and require adequate exercise to prevent boredom-associated behaviors such as chewing, digging, or licking. Boxers have earned a slight reputation of being headstrong, which can be related to inappropriate obedience training. Owing to their intelligence and working breed characteristics, training based on corrections often has limited usefulness.  \nThe Boxer by nature is not an aggressive or vicious breed. It is an instinctive guardian and can become very attached to its family. Like all dogs, it requires proper socialization. Boxers are generally patient with smaller dogs and puppies, but difficulties with larger adult dogs, especially those of the same sex, may occur. Boxers are generally more comfortable with companionship, in either human or canine form.","bestOf":{"family":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58efdc05272b281a0cbf1f2e"},"Bulldog":{"_id":"58f0d2ba8d74eb3d44f44006","imageURL":"/images/dogs/bulldog.jpg","energyLevel":"Medium","size":"Medium","akcRank":4,"shortDesc":"Calm, courageous, and friendly; dignified but amusing.","breedStandard":"https://www.akc.org/embeds/breed-standard/bulldog","grooming":"The breed requires minimal grooming and exercise.","exercise":"Not Very Active; Bulldogs won't beg to be exercised, but they require regular walks and the occasional romp.","health":"Bulldogs are generally a healthy breed.","club":"Bulldog Club of America","clubURL":"http://www.bulldogclubofamerica.org","breed":"Bulldog","imageURL2":"/images/dogs/bulldog2.jpg","function":"Companion","hypoallergenic":false,"shedding":"Low","exerciseIcon":"Low","groomIcon":"Low","__v":0,"longDesc":"According to the American Kennel Club (AKC), a Bulldog's disposition should be \"equable and kind, resolute, and courageous (not vicious or aggressive), and demeanor should be pacific and dignified. These attributes should be countenanced by the expression and behavior.\"\nBreeders have worked to reduce/remove aggression from these dogs. Most have a friendly, patient nature. Bulldogs are recognized as excellent family pets because of their tendency to form strong bonds with children.\nGenerally, Bulldogs are known for getting along well with children, other dogs, and pets, although some sources suggest keeping them away from cats.","bestOf":{"family":true,"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run","id":"58f0d2ba8d74eb3d44f44006"},"Chinese Shar-pei":{"_id":"58f1071dcefc5b1678c630cc","imageURL":"https://upload.wikimedia.org/wikipedia/commons/a/a7/Shar_pei_puppy_%28age_2_months%29.jpg","energyLevel":"Medium","size":"Medium","akcRank":61,"shortDesc":"Steadfastly devoted to loved ones, but standoffish and lordly toward strangers.","breedStandard":"https://www.akc.org/embeds/breed-standard/chinese-shar-pei","grooming":"The Shar-Pei are not always agreeable to grooming, so it’s a good idea to start grooming routines at an early age.","exercise":"The old guarding instinct remains strong: Shar-Pei are suspicious of strangers and other dogs.","health":"The average lifespan of the Chinese Shar-Pei is between 9 and 10 years. The deep skin folds of this breed can become infected, and the heavy skin around the eyes can require surgical correction. Inexperienced and rushed breeding in North America caused many health concerns.","club":"Chinese Shar-Pei Club of America, Inc.","clubURL":"http://www.cspca.com","breed":"Chinese Shar-pei","imageTitle":"By Yana Mishina (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AShar_pei_puppy_(age_2_months).jpg","imageURL2":"/images/dogs/sharpei.jpg","function":"Companion","hypoallergenic":false,"shedding":"Low","exerciseIcon":"Medium","groomIcon":"High","__v":0,"longDesc":"All Shar-Pei puppies need early socialization with children, strangers, and other animals. Some people may experience a sensitivity to the harshness of the coat of either length. This is a mild, short-lived rash that can develop on the skin that has been in contact with the coat, most commonly on the forearms.\nThe Shar Pei is often suspicious of strangers, which pertains to their origin as a guard dog. It is a very independent and reserved breed. Nevertheless, the Shar Pei is extremely devoted, loyal and affectionate to its family and is amenable to accepting strangers given time and proper introduction at a young age. If poorly socialized or trained, it can become especially territorial and aggressive. Even friendly and well-socialized individuals will retain the breed's watch dog proclivities (like barking at strangers). It is a largely silent breed, barking only when it is playing or worried. The Shar-Pei were originally bred as palace guards in China. Although Shar-Pei are sometimes stubborn, they are receptive to fair, compassionate training. With repetition and a clear reward system, training is not very difficult, however they do not respond well to negative and cruel treatment. The Shar Pei can be a dog that is loyal and loving to its family while being very protective. Shar-Pei do not like to be alone, preferring to be close to their humans, often lying nearby in the same room.","bestOf":{"guard":true,"quiet":true},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"st","energyLevelClass":"mdi-run","id":"58f1071dcefc5b1678c630cc"},"Chow Chow":{"_id":"58f10499cefc5b1678c630ca","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Tete_de_Chow-Chow.jpg/512px-Tete_de_Chow-Chow.jpg","energyLevel":"Medium","size":"Medium","akcRank":74,"shortDesc":"Serious-minded, dignified, bright, and aloof.","breedStandard":"https://www.akc.org/embeds/breed-standard/chow-chow","grooming":"A heavy seasonal shedder. It is important that owners use the correct tool in order to avoid harming the skin and facilitate grooming. Chow Chows are known to have either short and smooth coat, or a rougher and longer coat. Both create a thick woolly layer, as it gets closer to the skin. They should be brushed four times a week; however shedding seasons may require daily grooming.","exercise":"Serene and adaptable, with no special exercise needs, Chows happily take to apartment living.","health":"Chow Chows are generally a healthy breed with a life expectancy of 10 to 15 years.","club":"Chow Chow Club, Inc.","clubURL":"http://www.chowclub.org","breed":"Chow Chow","imageTitle":"By Clementp1986 (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3ATete_de_Chow-Chow.jpg\"><img width=\"512\" alt=\"Tete de Chow-Chow","imageURL2":"/images/dogs/chow.jpg","function":"Companion","type":"Spitz","hypoallergenic":false,"shedding":"Profuse","exerciseIcon":"Medium","groomIcon":"High","__v":0,"longDesc":"Chow Chows tend to display discernment of strangers and can become fiercely protective of their owners and property. \nChow Chow are not excessively active, meaning that they can be housed in an apartment. However, a Chow Chow living in an apartment will need daily exercise to prevent restlessness and boredom. \nThis breed of dog has many strong loyal bonds with friends and family, but the Chow Chow is usually overly protective of one or two main family members. It is in the breed’s nature to be quiet and well behaved, but it is also resistant to training. Chow Chows become very stubborn and attach to certain individuals, as they age. This is why training them when they are puppies is so crucial because they gain respect for those who care for them.\nIn order to avoid aggressive and over-protectiveness as an adult, continuous socialization as early as possible could allow the dog to adjust. When Chow Chows have reached adolescence they reject authority from any other owner who failed to earn its admiration. Aggression can be one distinctive behavioral characteristic in this breed, though while some are of an aggressive nature, many are known to be easy-going in nature - sometimes adopting an aloof disposition to individuals other than their owners. Aggression when it does appear is often towards other dogs of the same sex, especially Chows. Due to their strong hunting instincts, it is recommended that these dogs stay fenced, leashed, and away from cats and small dogs. This is why it is crucial that they are socialized early and consistently in order to act appropriately with strangers. At first, chow chows are very hesitant in interacting with strangers. However, this problem can be avoided if the owners train the chow chow at a young age.\nOwning a Chow Chow can raise the cost of homeowners insurance because some companies consider them high-risk dogs.","bestOf":{"family":false,"guard":true},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"th","energyLevelClass":"mdi-run","id":"58f10499cefc5b1678c630ca"},"Dachshund":{"_id":"58f0ee15cefc5b1678c630c7","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/%EB%8B%A5%EC%8A%A4%ED%9B%88%ED%8A%B8%28%EB%8B%A8%EB%AA%A8%EC%A2%85%29_%28Dachshund_%28Short%29%29.jpg/512px-%EB%8B%A5%EC%8A%A4%ED%9B%88%ED%8A%B8%28%EB%8B%A8%EB%AA%A8%EC%A2%85%29_%28Dachshund_%28Short%29%29.jpg","energyLevel":"Medium","size":"Small","akcRank":13,"shortDesc":"The weiner dog. Spunky and playful. Loyal and devoted to their owners.","breedStandard":"https://www.akc.org/embeds/breed-standard/dachshund","grooming":"Dachshunds come in 3 coat types: short and smooth, longhair, and wirehair. Silky-hair dachshunds can result from cross-breeding these coat types. The longhaired doxie will need regular visits to a groomer for haircuts.","exercise":"Dachshunds are lovable, playful companions, and an ideal pet for many homes. They would make a good companion for an apartment dweller.","health":"Dachshunds are generally a healthy breed. The average life expectancy for this breed is between 12 and 15 years.","club":"Dachshund Club of America, Inc.","clubURL":"http://www.dachshundclubofamerica.org","breed":"Dachshund","imageTitle":"By Katemil94 (Own work) [CC BY-SA 4.0 (http://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3A%EB%8B%A5%EC%8A%A4%ED%9B%88%ED%8A%B8(%EB%8B%A8%EB%AA%A8%EC%A2%85)_(Dachshund_(Short)).jpg","imageURL2":"/images/dogs/dachsund2.jpg","function":"Hunting","type":"Hound","hypoallergenic":false,"shedding":"Low","exerciseIcon":"Medium","groomIcon":"Low","__v":0,"longDesc":"Dachshunds are playful, but as hunting dogs can be quite stubborn, and are known for their propensity for chasing small animals, birds, and tennis balls with great determination and ferocity. Many dachshunds are stubborn, making them a challenge to train. Dachshunds are known for their devotion and loyalty to their owners, though they can be standoffish towards strangers. If left alone, many dachshunds will whine until they have companionship. Like many dogs if left alone too frequently, some dachshunds are prone to separation anxiety and may chew objects in the house to relieve stress.\nDachshunds are burrowers by nature and are likely to burrow in blankets and other items around the house, when bored or tired.\nDachshunds can be difficult to housebreak, and patience and consistency is often needed in this endeavor.\nMany dachshunds do not like unfamiliar people, and many will growl or bark at them. Although the dachshund is generally an energetic dog, some are sedate. This dog's behavior is such that it is not the dog for everyone. A bored, untrained dachshund will become destructive. If raised improperly and not socialized at a young age, dachshunds can become aggressive or fearful. They require a caring, loving owner who understands their need for entertainment and exercise.\nDachshunds may not be the best pets for small children. Like any dog, dachshunds need a proper introduction at a young age. Well trained dachshunds and well behaved children usually get along fine. Otherwise, they may be aggressive and bite an unfamiliar child, especially one that moves quickly around them or teases them. However, many dachshunds are very tolerant and loyal to children within their family, but these children should be mindful of the vulnerability of the breed's back.","bestOf":{"lowMaintenance":true,"apartment":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run","id":"58f0ee15cefc5b1678c630c7"},"Dalmatian":{"_id":"58efedd2272b281a0cbf1f38","imageURL":"/images/dogs/dalmatian.jpg","energyLevel":"High","size":"Medium","akcRank":62,"shortDesc":"A well-bred Dal is stable and outgoing; dignified but never shy.","breedStandard":"https://www.akc.org/embeds/breed-standard/dalmatian","grooming":"The Dalmatian’s short coat sheds almost year round, but regular brushing helps minimize the shedding.","exercise":"Very Active; Athletic, durable dogs created for long jaunts, Dals need their exercise.","health":"The Dalmatian is a comparatively healthy breed with few known health issues. The average life expectancy of the Dalmatian dog breed is between 11 and 13 years.","club":"Dalmatian Club of America, Inc.","clubURL":"http://www.thedca.org","breed":"Dalmatian","imageURL2":"/images/dogs/dalmatian2.jpg","function":"Companion","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"The Dalmatian was originally used to guard the carriages and horses of the upper class in the 1800's. While the master was busy, it was the Dalmatian's job to ensure the stock and carriage remained safe and untouched. Later, they became military sentries and circus performers, and most famously the mascots of fire companies. They are a versatile dog, capable of watching over a house or livestock, performing in advanced obedience competitions or simply acting as a loyal family companion. They love to be with people wand will want to be included in all family activities, whether indoor our outdoor. They travel well and love to go for rides in the car. Dalmatians are friendly with people and great with children, though toddlers can often be knocked down by an eager dog. They are great pets for first time dog owners and are generally a joy to live with.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"nd","energyLevelClass":"mdi-run-fast","id":"58efedd2272b281a0cbf1f38"},"Doberman Pinscher":{"_id":"58efee93272b281a0cbf1f39","imageURL":"/images/dogs/doberman.jpg","energyLevel":"High","size":"Medium","akcRank":15,"shortDesc":"Alert, fearless, loyal, and highly trainable.","breedStandard":"https://www.akc.org/embeds/breed-standard/doberman-pinscher","grooming":"Because the Doberman has a short coat he only needs minimal grooming.","exercise":"Very Active; Dobes are energetic dogs who need regular exercise to keep their magnificent physique.","health":"Doberman Pinschers are generally a healthy breed with an average life expectancy of between 10 and 12 years.","club":"Doberman Pinscher Club of America","clubURL":"http://www.dpca.org","breed":"Doberman Pinscher","imageURL2":"/images/dogs/doberman2.jpg","function":"Guard","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"The Doberman Pinscher's aggression has been toned down by modern breeders over the years, and today's Dobermans are known for a much more even and good natured temperament, extreme loyalty, high intelligence, and great trainability. The Dobie is known to be energetic, watchful, fearless and obedient.\nThey can easily learn to 'Respect and Protect' their owners, and are therefore considered to be excellent guard dogs that protect their loved ones. They are generally sociable toward humans and can be with other dogs. However, Dobermans rank among the more-likely breeds to show aggressive behavior toward strangers and other dogs, but not among the most likely to do so. \nAlthough the aggressiveness stereotype is less true today, the personality of the Dobie is unique. There is a great deal of scientific evidence that Doberman Pinschers have a number of stable psychological traits, such as certain personality factors and intelligence. One study found that Dobies, compared to other breeds, rank high in playfulness, average in curiosity/fearlessness, low on aggressiveness, and low on sociability. Psychologist Stanley Coren ranks the Doberman as the 5th most intelligent dog breed.","bestOf":{"active":true,"guard":true,"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58efee93272b281a0cbf1f39"},"Dogue de Bordeaux":{"_id":"58efe1f4272b281a0cbf1f31","imageURL":"/images/dogs/dogue.jpg","energyLevel":"Medium","size":"Large","akcRank":63,"shortDesc":"Loyal, affectionate, and protective; courageous but not aggressive.","breedStandard":"https://www.akc.org/embeds/breed-standard/dogue-de-bordeaux","grooming":"New Dogue de Bordeaux owners should be prepared to deal with drool!","exercise":"Not Very Active; A couple of good walks a day and a backyard romp are sufficient.","health":"Dogue de Bordeaux are generally a healthy breed with an average lifespan of 5 to 6 years.","club":"Dogue de Bordeaux Society of America","clubURL":"http://www.ddbsa.org/","breed":"Dogue de Bordeaux","imageURL2":"/images/dogs/dogue2.jpg","function":"Working","hypoallergenic":false,"shedding":"Low","exerciseIcon":"Low","groomIcon":"Low","__v":0,"longDesc":"Early socialization and training are a must. He is an excellent companion – affectionate and attached to his family – with a patient, calm temperament. This breed is eager to please and positive, firm training can yield wonderful results. They require moderate daily exercise. The Dogue de Bordeaux is excellent at cart-pulling and loves to compete in agility, rally and obedience with his owner. This is not an apartment dog. To stay fit, he needs some space and moderate daily exercise. But more than anything else, he requires personal interaction.\nDogues love to be an integral part of your family.\nDogue de Bordeaux puppies should be friendly and trusting, and with proper socialization, become reserved and discriminating as they mature. As with all mastiffs, socialization is an absolute requirement to avoid either aggression or shyness.\nAnimal aggression can be a problem; most Dogues will not start fights, but they will surely finish them.\nThis stubborn breed is inclined to do things his own way, but he will respond to early, consistent training that includes firm leadership, cheerful praise, and food rewards.\nThe Dogue de Bordeaux has an astonishing talent for snoring, sliming, and drooling. Slobber towels should be high on your list of canine accessories.","bestOf":{"family":true,"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"rd","energyLevelClass":"mdi-run","id":"58efe1f4272b281a0cbf1f31"},"Afghan Hound":{"_id":"58e6b040f0077232b8e9f38c","breed":"Afghan Hound","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/AfghanHound.jpg/512px-AfghanHound.jpg","imageTitle":"By Bryan Ungard (Flickr: DSC_3793) [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AAfghanHound.jpg","imageURL2":"/images/dogs/afghan-hound2.jpg","energyLevel":"High","size":"Large","akcRank":104,"shortDesc":"A breed of charming contradictions. Independent, aloof, sweet and profoundly loyal.","breedStandard":"https://www.akc.org/embeds/breed-standard/afghan-hound","club":"Afghan Hound Club of America, Inc.","clubURL":"http://www.afghanhoundclubofamerica.org/","grooming":"This magnificent coat will require frequent baths and thorough grooming.","groomIcon":"High","exercise":"Afghan Hounds require a lot of exercise. Long and lean, they need plenty of time a day to run and jump. Long walks are also beneficial to their health and muscle tone.","exerciseIcon":"High","health":"Find a veterinarian who is familiar with sighthounds and their specifc needs such as sensitivities with anesthesia.","function":"Guard","type":"Hound","hypoallergenic":true,"shedding":"No","__v":0,"longDesc":"The temperament of the typical Afghan Hound can be aloof and dignified, but happy and clownish when it's playing. This breed, as is the case with many sighthounds, has a high prey drive and may not get along with small animals. The Afghan Hound can be a successful competitor in dog agility trials as well as an intuitive therapy dog and companion. Don't let this breed off-leash, for he is unbelievably fast and can gallop out of sight in seconds. His high hipbones make him one of the most agile of all breeds and one of the best jumpers. Fences must be high.\nStandoffish by nature, the Afghan Hound needs extensive exposure to people and unusual sights and sounds so that his caution does not become timidity. \nObedience training will control his occasional bumptiousness and build his confidence, but you must be patient and persuasive, for sighthounds are extremely sensitive to leash jerking and may respond defensively if frightened. Independent and not particularly eager to please, their stubbornness takes the form of resistance rather than wild disobedience, i.e. they brace their legs and refuse to walk.\nAfghans can be finicky eaters and often are a bit slow to catch on to housebreaking.","bestOf":{"apartment":false,"family":false,"active":false,"guard":false,"quiet":false,"lowMaintenance":false},"favClass":"paw fav-off","akcRankHeart":"Green","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58e6b040f0077232b8e9f38c"},"Great Pyrenees":{"_id":"58f1003ccefc5b1678c630c9","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c2/Pyren%C3%A4en-Berghund_R%C3%BCde_2-j%C3%A4hrig.jpg/512px-Pyren%C3%A4en-Berghund_R%C3%BCde_2-j%C3%A4hrig.jpg","energyLevel":"Medium","size":"Large","akcRank":67,"shortDesc":"Confident, gentle (especially with kids), affectionate. Protective of flock or family.","breedStandard":"https://www.akc.org/embeds/breed-standard/great-pyrenees","grooming":"The Great Pyrenees' coat needs brushing once or twice a month, with monthly nail trims that include their double dew claws.","exercise":"The breed needs moderate exercise but tends to be somewhat lazy, especially in warm weather. They particularly enjoy cold weather and snow.","health":"Great Pyrenees are generally a healthy breed.","club":"Great Pyrenees Club of America, Inc.","clubURL":"http://www.gpcaonline.org/","breed":"Great Pyrenees","imageRef":"https://commons.wikimedia.org/wiki/File%3APyren%C3%A4en-Berghund_R%C3%BCde_2-j%C3%A4hrig.jpg","imageTitle":"By V.Beerenkotten (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageURL2":"/images/dogs/pyrenees.jpg","function":"Herding","type":"Shepherd","hypoallergenic":false,"shedding":"Average","exerciseIcon":"Medium","groomIcon":"Medium","__v":0,"longDesc":"While territorial and protective of its flock or family when necessary, ithe Great Pyrenees' general demeanor is one of composure, patience and loyalty. It is a strong willed, independent and reserved breed. It is also attentive, quite fearless and loyal to its duties. The Great Pyrenees' size makes it an imposing guardian. A dog of this breed will patrol its perimeter and may wander away if left off its leash in an unenclosed space. The Great Pyrenees protects its flock by barking, and being nocturnal, tends to bark at night unless trained against such behavior.\nThe Great Pyrenees can be slow to learn new commands, slow to obey, and somewhat stubborn to train. Not because of low intelligence, but more likely because the Pyr was bred to be fiercely independent, living on its own in the Pyrenees Mountains protecting its flock. Despite this relative stubbornness, it is quite unusual for the Great Pyrenees to become aggressive or turn on its master. It is wary of strangers if the person is not allowed in the house, but will settle down if the owner of the dog seems comfortable with the stranger. This dog was originally bred to be a livestock guard dog, and can still be found doing that job on farms and ranches.","bestOf":{"guard":true},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"th","energyLevelClass":"mdi-run","id":"58f1003ccefc5b1678c630c9"},"German Shepherd":{"_id":"58f0fc9dcefc5b1678c630c8","imageURL":"/images/dogs/germanshepherd2.png","energyLevel":"Medium","size":"Large","akcRank":2,"shortDesc":"Smart, confident, courageous, and steady; a true dog lover's dog.","breedStandard":"https://www.akc.org/embeds/breed-standard/german-shepherd-dog","grooming":"The breed's thick double short coat requires regular weekly grooming with a pin brush and slicker brush.","exercise":"These big guys were born to work; they require regular mental and physical exercise. They are not the ideal breed for apartment dwellers or people who live alone and work long hours. A daily walk will suit the GSD just fine.","health":"German Shepherd Dogs are generally a healthy breed. The average life expectancy of the German Shepherd is between 10 and 13 years.","club":"German Shepherd Dog Club of America","clubURL":"http://www.gsdca.org","breed":"German Shepherd","imageURL2":"/images/dogs/germanshepherd.png","function":"Guard","type":"Shepherd","hypoallergenic":false,"shedding":"Average","exerciseIcon":"Medium","groomIcon":"Medium","__v":0,"longDesc":"The German Shepherd Dog (GSD) is perhaps best known as the strong, courageous and obedient guide dog for the disabled and service dog of police K-9 and search-and-rescue units, valued for its tenacity, intelligence, loyalty and focus. While often sought as guard dogs and protectors, they are first and foremost a herding breed, GSDs can make outstanding, loving family companions. They have a distinct personality marked by a direct and fearless expression, obvious self-confidence and reluctance to develop indiscriminate friendships. They tend to be indifferent to strangers and can be aloof; however, once they befriend you, their devotion is life-long. German Shepherds can be as energetic as they are large, although they should be of even disposition and unflappable, with a restrained, composed and confident temperament. They should be patient, attentive, faithful and determined. They can be bold but should not be unnecessarily aggressive. They tend to bond well with children and enjoy participating in family activities like hiking, swimming, picnicking, running and the like. Farmers are often partial to German Shepherds because of their great intelligence, solid herding skills and seemingly endless energy. Regular walks will suit most GSDs just fine; many also enjoy off-leash romps in secure dog parks. They are particularly well suited to obedience training.","bestOf":{"guard":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"nd","energyLevelClass":"mdi-run","id":"58f0fc9dcefc5b1678c630c8"},"German Shorthaired Pointer":{"_id":"58efebb9272b281a0cbf1f36","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/German_Shorthaired_PointerMiedzynarodowa_wystawa_psow_rasowych_rybnik_kamien_pazdziernik_2011_15.jpg/512px-German_Shorthaired_PointerMiedzynarodowa_wystawa_psow_rasowych_rybnik_kamien_pazdziernik_2011_15.jpg","energyLevel":"High","size":"Medium","akcRank":11,"shortDesc":"Friendly, smart, willing to please. A top-notch hunting dog.","breedStandard":"https://www.akc.org/embeds/breed-standard/german-shorthaired-pointer","grooming":"This breed does have short coat but is also a heavy shedder.","exercise":"The GSP needs plenty of vigorous activity and thrives with lots of exercise and running. This need for exercise (preferably off lead) coupled with the breed's natural instinct to hunt, means that training is an absolute necessity. The GSP's distinctly independent character means that any unused energy will likely result in the dog amusing itself, most probably in an undesirable manner.","health":"German Shorthaired Pointers are generally a healthy breed. The average life expectancy for the GSP is between 12 and 14 years.","club":"German Shorthaired Pointer Club of America","clubURL":"http://www.gspca.org","breed":"German Shorthaired Pointer","imageTitle":"By Lilly_M (Own work) [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AGerman_Shorthaired_PointerMiedzynarodowa_wystawa_psow_rasowych_rybnik_kamien_pazdziernik_2011_15.jpg","imageURL2":"/images/dogs/gshpointer.png","function":"Hunting","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"The German Shorthaired Pointer was developed to be a dog suited for family life, as well as a versatile hunter. It is an intelligent, bold, boisterous, eccentric, and affectionate dog that is cooperative and easily trained. The GSP is usually good with children, although care should be taken because the breed can be boisterous especially when young. These dogs love interaction with humans and are suitable pets for active families who will give them an outlet for their considerable energy; they must be avidly run multiple times a week. Most GSPs make excellent watchdogs. The breed generally gets along well with other dogs, though females appear to be much more dominant during interbreed interaction. A strong hunting instinct is correct for the breed, which is not always good for other small pets such as cats or rabbits.\nIf GSPs are not sufficiently exercised and/or properly trained, they can become can appear hyperactive or have destructive tendencies. Thus the breed is not a suitable pet for an inactive home or for inexperienced dog owners. A bored GSP may feel compelled to exercise himself. These dogs are athletic and can escape from four- to six-foot enclosures with little difficulty. Regular hunting, running, carting, bikejoring, skijoring, mushing, dog scootering or other vigorous activity can alleviate this desire to escape. The natural instinct to hunt may result in the dog hunting alone and sometimes bringing home occasional dead trophies, such as cats, rats, pigeons and other urban animals. In addition to exercise, especially formal hunting, the GSP needs to be taught to distinguish legitimate prey and off limits animals.\nThe GSP can perform virtually all gun dog roles. It is a pointer and retriever, an upland bird dog and water dog. The GSP can be used for hunting larger and more dangerous game. It is an excellent swimmer but also works well in rough terrain. It is tenacious, tireless, hardy, and reliable. GSPs are proficient with many different types of game and sport, including trailing, retrieving, and pointing pheasant, quail, grouse, waterfowl, raccoons, possum, and even deer.\nWith this breed having superb hunting ability and companionable personality, the intelligence and the obedience of the GSP make it one of the more popular large breeds.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58efebb9272b281a0cbf1f36"},"Golden Retriever":{"_id":"58efd953272b281a0cbf1f2c","imageURL":"/images/dogs/goldenretriever.jpg","energyLevel":"Medium","size":"Large","akcRank":3,"shortDesc":"Intelligent, friendly, and devoted. Great family dog.","breedStandard":"https://www.akc.org/embeds/breed-standard/golden-retriever","grooming":"The Golden’s water-repellant double-coat sheds seasonally and needs regular brushing as a part of his weekly grooming.","exercise":"Very Active; This dog is active and energetic, and needs daily exercise. They love to join in on family excursions and love anything to do with water.","health":"Golden Retrievers are generally a healthy breed. The average life span for these dogs is between 10 and 12 years.","club":"Golden Retriever Club of America","clubURL":"http://www.grca.org","breed":"Golden Retriever","imageURL2":"/images/dogs/goldenretriever2.jpg","function":"Hunting","type":"Retriever","hypoallergenic":false,"shedding":"Profuse","exerciseIcon":"High","groomIcon":"Medium","__v":0,"longDesc":"The temperament of the Golden Retriever is a hallmark of the breed, and is described in the standard as \"kindly, friendly and confident\". Golden Retrievers make good family pets, particularly as they are patient with children. They are not \"one-man dogs\" and are generally equally amiable with both strangers and those familiar to them. Their trusting, gentle disposition makes them a poor guard dog. The typical Golden Retriever is calm, naturally intelligent and biddable, and with an exceptional eagerness to please.\nGolden Retrievers are also noted for their intelligence. The breed ranks fourth in Stanley Coren's \"The Intelligence of Dogs\" – following the Border Collie, Poodle, and German Shepherd – as one of the brightest dogs ranked by obedience-command trainability.\nTypical Golden Retrievers are active and fun-loving animals with the exceptionally patient demeanour befitting a dog bred to sit quietly for hours in a hunting blind. Adult Goldens love to work, and have a keen ability to focus on a given task. They will work until they collapse, so care should be taken to avoid overworking them.\nOther characteristics related to their hunting heritage are a size suited for scrambling in and out of boats and an inordinate love for water. Golden Retrievers are exceptionally trainable—due to their intelligence, athleticism and desire to please their handlers—and excel in obedience trials. They are also very competitive in agility and other performance events. Harsh training methods are unnecessary, as Golden Retrievers often respond very well to positive and upbeat training styles.\nGolden Retrievers are compatible with other dogs, cats, and most livestock. They are particularly valued for their high level of sociability towards people, calmness, and willingness to learn. Because of this, they are commonly used as guide dogs, mobility assistance dogs, and search and rescue dogs.","bestOf":{"family":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"rd","energyLevelClass":"mdi-run","id":"58efd953272b281a0cbf1f2c"},"Jack Russell Terrier":{"_id":"58f0e1557decb434c07599c6","breed":"Jack Russell Terrier","imageURL":"/images/dogs/jackrussell.png","imageURL2":"/images/dogs/jackrussell2.jpg","function":"Hunting","type":"Terrier","hypoallergenic":false,"shedding":"Low","size":"Small","energyLevel":"High","exerciseIcon":"High","exercise":"An energetic breed that need a high level of exercise and stimulation and can be moody and destructive when bored. Although a small dog, they are not suitable to apartment life because of their need for lots of activity. A fenced-in yard is good, but they are diggers and not unusual for them to dig under fences.","grooming":"Jack Russell's short coat is a breeze to maintain, only requiring regular baths and nail trims.","groomIcon":"Low","health":"The breed has a reputation for being healthy with a long lifespan","shortDesc":"Clever and energetic, strong-willed and athletic. Great dog for an active owner!","clubURL":"https://www.therealjackrussell.com/index.php","club":"Jack Russell Terrier Club of America","breedStandard":"","__v":0,"longDesc":"Jack Russells are first and foremost a working terrier. Originally bred to bolt foxes from their dens during hunts, they are used on numerous ground-dwelling quarry such as groundhog, badger, and red and grey fox. The working JRT is required to locate quarry in the earth, and then either bolt it or hold it in place until they are dug to. To accomplish this, the dog will not bark but will expect attention to the quarry continuously. Because the preservation of this working ability is of highest importance to most registered breeders, Jack Russells tend to be extremely intelligent, athletic, fearless, and vocal dogs. It is not uncommon for these dogs to become moody or destructive if not properly stimulated and exercised, as they have a tendency to bore easily and will often create their own fun when left alone to entertain themselves.\nTheir high energy and drive make these dogs ideally suited to a number of different dog sports such as flyball or agility. Obedience classes are also recommended to potential owners, as JRTs can be stubborn at times and aggressive towards other animals and humans if not properly socialized. Despite their small size, these dogs are not recommended for the condominium or apartment dweller unless the owner is ready to take on the daunting task of providing the dog with the necessary amount of exercise and stimulation. They have a tremendous amount of energy for their size, a fact which can sometimes lead to trouble involving larger animals. They may seem never to tire and will still be energetic after their owner has called it a day. While socialized members of the breed are friendly towards children, they will not tolerate abuse even if it is unintentional.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Blank","ordinal":"","energyLevelClass":"mdi-run-fast","id":"58f0e1557decb434c07599c6"},"Komondor":{"_id":"58f1089ccefc5b1678c630cd","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a0/Komondor_IMG_0329.JPG/512px-Komondor_IMG_0329.JPG","energyLevel":"Medium","size":"Large","akcRank":177,"shortDesc":"Dignified, brave, protective, steadfastly loyal","breedStandard":"https://www.akc.org/embeds/breed-standard/komondor","grooming":"Caring for the Komondor coat takes quite a bit of time and effort.","exercise":"Somewhat Active; A Kom without a big, fenced-in area to patrol will need two or three good walks daily.","health":"Komondorok are generally a healthy breed.","club":"Komondor Club of America, Inc.","clubURL":"http://komondorclubofamerica.org/","breed":"Komondor","imageRef":"https://commons.wikimedia.org/wiki/File%3AKomondor_IMG_0329.JPG\"><img width=\"512\" alt=\"Komondor IMG 0329","imageTitle":"By Kari (Suomi) [GFDL (http://www.gnu.org/copyleft/fdl.html), CC-BY-SA-3.0 (http://creativecommons.org/licenses/by-sa/3.0/) or CC BY 2.5 (http://creativecommons.org/licenses/by/2.5)], via Wikimedia Commons","imageURL2":"/images/dogs/komondor.png","function":"Guard","type":"Shepherd","hypoallergenic":true,"shedding":"No","exerciseIcon":"Medium","groomIcon":"High","__v":0,"longDesc":"The Komondor is built for livestock guarding. The Komondor's temperament is like that of most livestock guarding dogs; it is calm and steady when things are normal, but in case of trouble, the dog will fearlessly defend its charges. It was bred to think and act independently and make decisions on its own.\nIt is affectionate with its family, and gentle with the children and friends of the family. Although wary of strangers, they can accept them when it is clear that no harm is meant, but is instinctively very protective of its family, home and possessions. The Komondor is very good with other family pets, often very protective over them, but is intolerant to trespassing animals and is not a good dog for an apartment. The dog is vigilant and will rest in the daytime, keeping an eye on the surroundings, but at night is constantly moving, patrolling the place, moving up and down around the whole area. The dogs usually knock down intruders and keep them down until the owner arrives. Hungarian Komondor breeders used to say that an intruder may be allowed to enter the property guarded by a Komondor, but he will not be allowed to come out again.","bestOf":{"guard":true},"favClass":"paw fav-off","akcRankHeart":"Green","ordinal":"th","energyLevelClass":"mdi-run","id":"58f1089ccefc5b1678c630cd"},"Kuvasz":{"_id":"58f1062ccefc5b1678c630cb","imageURL":"https://upload.wikimedia.org/wikipedia/commons/7/76/Kuvasz_named_Kan.jpg","energyLevel":"Medium","size":"Large","akcRank":165,"shortDesc":"Intensely loyal, protective, utterly fearless; sweet and patient with family. A natural guard dog.","breedStandard":"https://www.akc.org/embeds/breed-standard/kuvasz","grooming":"The Kuvasz coat is very easy to care for, needing only brushing. Seasonal shedding can be profuse.","exercise":"This breed shines in a working environment as a livestock guard dog, and the daily activity such a life would provide. Due to their instinctual need to guard and work, this breed should not be considered by an inexperienced dog owner without proper research.","health":"The Kuvasz is a rugged, healthy breed with few health issues. They can be expected to live approximately 12–14 years. Prone the to developmental bone problems, should take care to provide proper nutrition to their puppy and avoid subjecting to rough play.","club":"Kuvasz Club of America","clubURL":"http://www.kuvasz.com","breed":"Kuvasz","imageTitle":"By Erdelyi kopo (self made (Erdelyi kopo)) [Public domain], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AKuvasz_named_Kan.jpg","imageURL2":"/images/dogs/kuvasz.jpg","function":"Herding","type":"Shepherd","hypoallergenic":false,"shedding":"Average","exerciseIcon":"Medium","groomIcon":"Medium","__v":0,"longDesc":"The Kuvasz is an intelligent dog and is often described as having a clownish sense of humor which can last throughout their adolescence and into adulthood. They are intensely loyal and patient pets who appreciate attention but may also be somewhat aloof or independent, as well as thoroughly cunning, particularly with strangers. The Kuvasz breed is for experienced handlers only. The combination of intelligence, independence and protectiveness make obedience training and socialization absolute necessities. They are strictly working dogs, bred for centuries to think independently and act without instruction, scanning and evaluating the environment and taking protective or deterrent action as needed. This was a vital trait in their solitary duties protecting livestock. That independence can make training a difficult task, wearing on the patience of even experienced owners. Kuvasz quickly understand what is being asked of them, but they have to respect a person as a trusted leader before they'll obey commands. They're also not usually interested in meaningless activity, such as doing entertaining tricks. As a result, they are not recommended for novices and those who do not have time to train and socialize them properly. An adolescent Kuvasz should be able to learn basic obedience commands and consistently respond to them; however the instinctive need to investigate strangers and protect its owner may cause the Kuvasz to act independently when off leash and ignore the calls of a handler. Interactions with other dogs, especially first meetings, should be managed carefully. One of the tasks of a livestock guardian is to kill wolves, coyotes, and other predators, and this instinct remains intact in the modern dog. Handlers should be alert to signs of tension, and intervene before a dangerous situation develops. However, a well socialized, well trained Kuvasz will usually ignore, play with, or go exploring with other dogs once a successful introduction has been made. Finally, a potential owner should refrain from purchasing a Kuvasz if barking will be a problem at the home. While not every Kuvasz is prone to barking (socializing them will define what is a threat), many of them fulfill their guardian role by vocally warning off potential threats, both real and imagined. On the other hand, many of these qualities make the Kuvasz excellent guardians for sheep or large estates. The Kuvasz has a very special, close connection to his owner or family, as well as anyone in their circle, human or animal, that the dog considers part of the flock. He will protect all of them. He may also police interactions among them, such as discouraging rough play by herding rowdy individuals away from the group. The owner has the responsibility for setting clear, consistent limits on this behavior. That connection can easily be lost if the dog is humiliated, confused by contradictory commands, or otherwise abused.","bestOf":{"guard":true},"favClass":"paw fav-off","akcRankHeart":"Green","ordinal":"th","energyLevelClass":"mdi-run","id":"58f1062ccefc5b1678c630cb"},"Labrador Retriever":{"_id":"58e6b040f0077232b8e9f38a","breed":"Labrador Retriever","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Labrador_Retriever_black_portrait_Ellis.jpg/512px-Labrador_Retriever_black_portrait_Ellis.jpg","imageRef":"https://commons.wikimedia.org/wiki/File%3ALabrador_Retriever_black_portrait_Ellis.jpg","imageTitle":"By Marilyn Peddle (Flickr) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons","imageURL2":"/images/dogs/lab2.jpg","energyLevel":"High","size":"Medium","akcRank":1,"shortDesc":"Active, friendly, enthusiastic and outgoing. A great family dog!","breedStandard":"https://www.akc.org/embeds/breed-standard/labrador-retriever","club":"The Labrador Retriever Club, Inc.","clubURL":"http://www.thelabradorclub.com/","grooming":"A double-coated breed which sheds seasonally, regular grooming keeps his coat at its water-resistant best. Some Labs will shed more than others.","groomIcon":"Low","exercise":"Labrador Retrievers have energy to spare and are not well suited for couch potatoes. They are also rather large and clumsy, so apartments are not the best living arrangements for this breed. Homes with yards and lots of room to romp are the most ideal setting to raise a Lab. These dogs need to run every day in order to burn off excess energy, and if they aren't properly exercised they will become destructive. If you have a pool, be forewarned...you will not these guys out of the water.","exerciseIcon":"High","health":"Generally a healthy breed. The average life span of the Labrador Retriever is between 10 and 14 years.","function":"Hunting","type":"Retriever","hypoallergenic":false,"shedding":"Average","__v":0,"longDesc":"The Labrador is kind, pleasant, outgoing and tractable. A Lab's sense of smell allows them to home in on almost any scent and follow the path of its origin. They generally stay on the scent until they find it. Labs instinctively enjoy holding objects, which they can do with great gentleness. They are known to have a very soft feel to the mouth, as a result of being bred to retrieve game such as waterfowl. They are prone to chewing objects (though they can be trained to abandon this behavior). Labradors have a reputation as a very even-tempered breed and an excellent family dog. This includes a good reputation with children of all ages and other animals. Their fun-loving boisterousness and lack of fear may require training and firm handling at times to ensure it does not get out of hand. Labs mature at around 3 years of age; before this time they can have a significant degree of puppy-like energy. Because of their enthusiasm, leash-training early on is suggested to prevent pulling when full-grown. Labradors often enjoy retrieving a ball endlessly (often obsessively) and other forms of activity.\nAlthough they will sometimes bark at noise, Labs are usually not noisy or territorial. They are often very easygoing and trusting with strangers and therefore are not usually suitable as guard dogs.\nLabs as a breed are exploratory and love company, following both people and interesting scents for food, attention, and novelty value. As a breed they are highly intelligent and capable of intense single-mindedness and focus if motivated or their interest is caught. Therefore, with the right conditions and stimuli, a bored Labrador could \"turn into an escape artist. Labs have a well-known appetite, and some individuals may be highly indiscriminate, eating digestible and non-food objects alike. They are persistent and persuasive in requesting food. For this reason, the Labrador owner must carefully control their dog's food intake to avoid obesity.\nThe steady temperament and their ability to learn make them an ideal breed for search and rescue, detection, and therapy work. They are a very intelligent breed, ranking # 7 in Stanley Coren's \"The Intelligence of Dogs.\" The AKC describes the breed as an ideal family and sporting dog. Their primary working role in the field continues to be that of a hunting retriever.","bestOf":{"apartment":false,"family":true,"active":true,"guard":false,"quiet":false,"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"st","energyLevelClass":"mdi-run-fast","id":"58e6b040f0077232b8e9f38a"},"Lagotto Romagnolo":{"_id":"58f0d9537decb434c07599c1","imageURL":"https://upload.wikimedia.org/wikipedia/commons/9/97/Lagotto_romagnolo2.jpg","energyLevel":"High","size":"Medium","akcRank":114,"shortDesc":"The truffle-searching dog! Loving and loyal with a sharp sense of smell.","breedStandard":"https://www.akc.org/embeds/breed-standard/lagotto-romagnolo","grooming":"The breed's double coat of curly hair does not shed, but requires occasional trimming and brushing to avoid matting.","exercise":"They are easily trained, enjoy their owners, love to take long walks, and basically are very agreeable.","health":"Lagotto Romagnolos are generally a healthy breed, living roughly 16 years.","club":"Lagotto Romagnolo Club of America, Inc.","clubURL":"http://www.lagottous.com","breed":"Lagotto Romagnolo","imageTitle":"By Rdo01 (Ralf Ostermann) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3ALagotto_romagnolo2.jpg","imageURL2":"/images/dogs/lagotto.png","function":"Working","hypoallergenic":true,"shedding":"Low","exerciseIcon":"Medium","groomIcon":"Medium","__v":0,"longDesc":"The Lagotto is made to work. They generally have sharp senses, though their eyesight is more sensitive to motion than detail. They are very loyal and loving, making them the perfect family companion. Some are easy to train, and many get along with other animals quite easily if they're socialized as puppies. Lagotti (the plural form of Lagotto) vary in their need for exercise, but should always be given stimulation to keep their intelligent brains occupied. Lagotti have a natural instinct for retrieving. Whilst the instinct to hunt, swim and retrieve is inborn and does not have to be encouraged, Lagotti have to be trained from an early age to look for truffles.\nIn modern times, the Lagotto has been bred primarily as a truffle-searching dog, and not as a retriever or hunting dog. Its highly developed noses makes it an excellent search dog.\nSome Lagotti are excellent swimmers, but some will only paddle. Some will retrieve from lakes, streams and other bodies of water without hesitation. They are lovable family pets and tend to like attention. Lagotti love to dig; many owners give them a sandbox, or have a designated place to allow them satisfy their digging urges. They also love to play seeking games and have very active, and clever minds.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Green","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58f0d9537decb434c07599c1"},"Old English Sheepdog":{"_id":"58efe14c272b281a0cbf1f30","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/Old_English_Sheep_Dog.JPG/512px-Old_English_Sheep_Dog.JPG","energyLevel":"Medium","size":"Large","akcRank":75,"shortDesc":"Adaptable, smart, gentle; Old English Sheepdogs are famous for their sweet, agreeable nature.","breedStandard":"https://www.akc.org/embeds/breed-standard/old-english-sheepdog","grooming":"Beyond regular weekly grooming with a brush they need the occasional bath to keep them clean.","exercise":"Somewhat Active; A mellow housedog, but the OES is a big, agile dog who likes exploring, long walks, and a good gallop.","health":"Old English Sheepdog are generally a healthy breed with an average lifespan of the Old English Sheepdog at 10–11 years.","club":"Old English Sheepdog Club of America, Inc.","clubURL":"http://www.oldenglishsheepdogclubofamerica.org","breed":"Old English Sheepdog","imageTitle":"Squigman [Public domain], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AOld_English_Sheep_Dog.JPG","imageURL2":"/images/dogs/oldenglishsheepdog.jpg","function":"Herding","type":"Shepherd","hypoallergenic":false,"shedding":"Average","exerciseIcon":"Medium","groomIcon":"High","__v":0,"longDesc":"The breed standards describe the ideal Old English Sheepdog as never being nervous or aggressive. The New Zealand Kennel Club adds that \"they are sometimes couch potatoes\" and \"may even try to herd children by gently bumping them.\" This breed's temperament can be described as intelligent, social and adaptable. The American Kennel Club adds that the breed has \"a clownish energy\" and \"may try to herd people or other objects.\"\nWith wide open spaces being the ideal setting for an Old English Sheepdog, the breed is a natural fit in a rural setting, such as working on a farm; although, with proper exercise and training, they are perfectly comfortable with a suburban or urban lifestyle. Their remarkable, inherent herding instincts, sense of duty, and sense of property boundaries may be nurtured and encouraged accordingly, or subdued by their owners. Old English Sheepdogs should not be deprived of the company and the warmth of people.","bestOf":{"family":true},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"th","energyLevelClass":"mdi-run","id":"58efe14c272b281a0cbf1f30"},"Pembroke Welsh Corgi":{"_id":"58f0db6e7decb434c07599c2","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/7f/Pembroke_Corgi_Image_001.jpg/512px-Pembroke_Corgi_Image_001.jpg","energyLevel":"Medium","size":"Medium","akcRank":18,"shortDesc":"Smart and alert, affectionate but not pushy, bold but kindly.","breedStandard":"https://www.akc.org/embeds/breed-standard/pembroke-welsh-corgi","grooming":"The breed's short coat needs little maintenance.","exercise":"Very Active; A strong and athletic little dog, the Pembroke loves physical activity and is happiest when he has a job.","health":"Pembroke Welsh Corgis are generally a healthy breed, although they can be prone to obesity. They have an average life expectancy of 12–15 years.","club":"Pembroke Welsh Corgi Club of America, Inc.","clubURL":"http://www.pembrokecorgi.org","breed":"Pembroke Welsh Corgi","imageTitle":"By Flickr user mbostock (Flickr here) [CC BY-SA 2.0 (http://creativecommons.org/licenses/by-sa/2.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3APembroke_Corgi_Image_001.jpg","imageURL2":"/images/dogs/pemcorgi2.jpg","function":"Herding","hypoallergenic":false,"shedding":"Average","exerciseIcon":"High","groomIcon":"Medium","__v":0,"longDesc":"Pembroke Welsh Corgis are very affectionate, love to be involved in the family, and tend to follow wherever their owners go. They have a great desire to please their owners, thus making them eager to learn and train. The dogs are easy to train and are ranked as the eleventh smartest dog in Stanley Coren's \"The Intelligence of Dogs.\" Besides herding, they also function as watchdogs due to their alertness and tendency to bark only as needed. Most Pembrokes will seek the attention of everyone they meet and behave well around children and other pets. It is important to socialize this breed with other animals, adults, and children when they are very young to avoid any anti-social behavior or aggression later in life. Due to their herding instinct, they love to chase anything that moves, so it is best to keep them inside fenced areas. The herding instinct will also cause some younger Pembrokes to nip at their owners' ankles.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run","id":"58f0db6e7decb434c07599c2"},"Portuguese Water Dog":{"_id":"58efe968272b281a0cbf1f35","imageURL":"/images/dogs/portwaterdog.jpg","energyLevel":"High","size":"Medium","akcRank":51,"shortDesc":"The PWD is an “A” student: Affectionate, athletic, and adventurous.","breedStandard":"https://www.akc.org/embeds/breed-standard/portuguese-water-dog","grooming":"Their soft, fluffy coats are hypoallergenic, but will require regular grooming.","exercise":"Portuguese Water Dogs are not for everyone. Because of their intelligence and working drive, they require regular intensive exercise as well as mental challenges. They are gentle and patient — but not \"couch potatoes\", and boredom can cause them to become destructive.","health":"Portuguese Water Dogs are generally a healthy breed. The average life span of the Portuguese Water Dog is 11 to 14 years.","club":"Portuguese Water Dog Club of America, Inc.","clubURL":"http://www.pwdca.org","breed":"Portuguese Water Dog","imageURL2":"/images/dogs/portwaterdog2.jpg","function":"Working","hypoallergenic":true,"shedding":"No","exerciseIcon":"Medium","groomIcon":"High","__v":0,"longDesc":"Portuguese Water dogs are loving, independent, and intelligent and are easily trained in obedience and agility skills. Once introduced, they are generally friendly to strangers, and enjoy being petted.\nBecause they are working dogs, PWDs are generally content in being at their master's side, awaiting directions, and, if they are trained, they are willing and able to follow complex commands. They learn very quickly, seem to enjoy the training, and have a long memory for the names of objects. These traits and their non-shedding coats mean they excel at the various Service Dog roles such as hearing dogs (assistance dogs for the deaf), mobility dogs, and seizure response dogs. They also make unusually good therapy dogs.\nA PWD usually stays in proximity to its owners, both indoors and outdoors. Although very gregarious animals, these dogs will typically bond with one primary or alpha family member. Some speculate that this intense bonding arose in the breed because the dogs were selected to work in proximity to their masters on small fishing boats, unlike other working dogs such as herding dogs and water dogs that range out to perform tasks. In any case, the modern PWD, whether employed on a boat or kept as a pet or a working dog, loves water and attention and prefers to be engaged in activity within sight of a human partner. This is not a breed to be left alone for long periods of time, indoors or out.\nAs water dogs, the PWD's retrieving instinct is strong, which also gives some dogs tugging and chewing tendencies.\nA PWD will commonly jump as a greeting. Owners may choose to limit this behavior. Some PWDs may walk, hop, or \"dance\" on their hind legs when greeting or otherwise enthusiastic. Some PWDs will stand upright at kitchen counters and tables, especially if they smell food above them. This habit is known as \"counter surfing\" and is characteristic of the breed. Although it can be a nuisance, many PWD owners evidently enjoy seeing their dogs walking, hopping, standing up, or \"countering\" and do not seriously discourage these activities.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"st","energyLevelClass":"mdi-run-fast","id":"58efe968272b281a0cbf1f35"},"Rat Terrier":{"_id":"58eff013272b281a0cbf1f3a","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Rat_Terrier_Image_001.jpg/512px-Rat_Terrier_Image_001.jpg","energyLevel":"Medium","size":"Small","akcRank":96,"shortDesc":"Friendly, lovable, inquisitive; fearlessly game for just about anything.","breedStandard":"https://www.akc.org/embeds/breed-standard/rat-terrier","grooming":"The breed sheds seasonally and requires brushing with a soft brush or rubber curry mitt.","exercise":"Rat Terriers are little, but they need a lot of extensive activity to maintain health, happiness and an even temperament. They thrive on farms, and are the most efficient rodent catchers you'll find. If you don't live on a farm, you'll want to walk your Rat Terrier a couple of times a day","health":"Rat Terriers are generally a healthy breed. The average lifespan of a well-bred Rat Terrier is 16–19 years.","club":"Rat Terrier Club of America","clubURL":"http://www.theratterrierclubofamerica.com","breed":"Rat Terrier","imageTitle":"By Flickr user tiarescott (Flickr here) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3ARat_Terrier_Image_001.jpg","imageURL2":"/images/dogs/ratterrier.jpg","function":"Hunting","type":"Terrier","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"According to legend, the Rat Terrier got his name from Theodore Roosevelt. These dogs were brought into the White House to help control a rat infestation, and they made quick work of the rodents, eliminating them completely from the executive mansion. They are high energy dogs who love to be “at work,” chasing, digging for and killing pests. They are independent dogs who may not listen very well, but the families who love them say Rat Terriers keep them laughing all day long. Ratters love farm life, soaking up the outdoors and keeping the grounds free from destructive pests. Suburban Ratters enjoy walking, jogging and playing ball for hours on end. Active families will get as much back from a Rat Terrier as they are willing to give.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Orange","ordinal":"th","energyLevelClass":"mdi-run","id":"58eff013272b281a0cbf1f3a"},"Rhodesian Ridgeback":{"_id":"58eff17a272b281a0cbf1f3b","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/6/68/Rhodesian_Ridgeback_1.JPG/512px-Rhodesian_Ridgeback_1.JPG","energyLevel":"Medium","size":"Medium","akcRank":42,"shortDesc":"Dignified, even tempered; affectionate toward loved ones, reserved with strangers.","breedStandard":"https://www.akc.org/embeds/breed-standard/rhodesian-ridgeback","grooming":"Due to their short coats Rhodesian Ridgebacks shed very little and require only weekly brushing.","exercise":"This breed needs a lot of vigorous exercise to maintain health, happiness and an even temperament. Rhodesian Ridgebacks have their roots in Africa, so they can withstand a lot of activity in very high temperatures without slowing down. They require several walks a day and plenty of time to run outdoors. Without proper exercise, this breed can become anxious and destructive.","health":"Rhodesian Ridgebacks are generally a healthy breed with an average life expectancy between 10 and 12 years.","club":"Rhodesian Ridgeback Club of the United States, Inc.","clubURL":"http://www.rrcus.org","breed":"Rhodesian Ridgeback","imageTitle":"By Vulkano12 (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3ARhodesian_Ridgeback_1.JPG","imageURL2":"/images/dogs/rhodie.jpg","function":"Hunting","type":"Hound","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"Rhodesian ridgebacks are loyal, intelligent, and somewhat aloof to strangers. This is not to be confused with aggression; a ridgeback of proper temperament will be more inclined to ignore, rather than challenge, a stranger. This breed requires positive, reward-based training, good socialization and consistency; it is often not the best choice for inexperienced dog owners. Ridgebacks are strong-willed, intelligent, and many seem to have a penchant for mischief, though loving. They are protective of their owners and families. If trained well, they can be excellent guard dogs. Like any dog, they can become aggressive when they are not socialized properly.\nDespite their athletic, sometimes imposing, exterior, the ridgeback has a sensitive side. Francis R. Barnes, who wrote the first standard in 1922, acknowledged that \"rough treatment ... should never be administered to these dogs, especially when they are young. They go to pieces with handling of that kind.\" The ridgeback accepts correction as long as it is fair and justified, and as long as it comes from someone it knows and trusts.","bestOf":{"active":true,"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"nd","energyLevelClass":"mdi-run","id":"58eff17a272b281a0cbf1f3b"},"Rottweiler":{"_id":"58f0ec7dcefc5b1678c630c6","imageURL":"https://upload.wikimedia.org/wikipedia/commons/7/72/Rottweiler-Head.jpg","energyLevel":"Medium","size":"Medium","akcRank":8,"shortDesc":"Reserved with strangers and affectionate and loyal with his family.","breedStandard":"https://www.akc.org/embeds/breed-standard/rottweiler","grooming":"The breed's short coat needs little maintenance beyond regular weekly grooming with a brush and the occasional bath.","exercise":"The Rottie needs at least two solid workouts daily; he would really appreciate it if these always included you! Can be prone to overheating in hot weather due to their black coat.","health":"Rottweilers are generally a healthy breed. If overfed or under-exercised, Rottweilers are prone to obesity.","club":"American Rottweiler Club","clubURL":"http://www.amrottclub.org","breed":"Rottweiler","imageTitle":"By Rains27 (Rottweiler Ares) [Public domain], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3ARottweiler-Head.jpg","imageURL2":"/images/dogs/rottie.png","function":"Working","hypoallergenic":false,"shedding":"Low","exerciseIcon":"Medium","groomIcon":"Low","__v":0,"longDesc":"The Rottweiler is good-natured, placid in basic disposition, very devoted, obedient, biddable and eager to work. Their appearance is natural and rustic, their behavior self-assured, steady and fearless. They react to their surroundings with great alertness. Rottweilers are a powerful breed with well-developed genetic herding and guarding instincts. Potentially dangerous behavior in Rottweilers usually results from irresponsible ownership, abuse, neglect, or lack of socialization and training. However, the exceptional strength of the Rottweiler is an additional risk factor not to be neglected. It is for this reason that breed experts declare that formal training and extensive socialization are essential for all Rottweilers. According to the AKC, Rottweilers love their owners and may behave in a clownish manner toward family and friends, but they are also protective of their territory and do not welcome strangers until properly introduced. Obedience training and socialization as puppies are necessary to raising a well-adjusted Rottweiler.","bestOf":{"lowMaintenance":true,"guard":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run","id":"58f0ec7dcefc5b1678c630c6"},"Siberian Husky":{"_id":"58f0e8ebcefc5b1678c630c4","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/2e/Pure_White_Siberian_Husky.jpg/512px-Pure_White_Siberian_Husky.jpg","energyLevel":"High","size":"Medium","akcRank":12,"shortDesc":"Friendly, gentle, dignified; alert, but not aggressive.","breedStandard":"https://www.akc.org/embeds/breed-standard/siberian-husky","grooming":"Siberians are relatively easy keepers, but their thick coats require weekly brushing.","exercise":"Siberian Huskies need a lot of vigorous activity in order to maintain health and happiness. They were developed as sled dogs, which means they have energy and endurance to spare, so adopting a Husky means adopting an active lifestyle. This breed enjoys long walks, hikes, jogs and bike rides.","health":"Siberian Huskies are generally a healthy breed with an average life span of 12 to 14 years.","club":"Siberian Husky Club of America, Inc.","clubURL":"http://www.shca.org","breed":"Siberian Husky","imageTitle":"By Rafa.rodriguez (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3APure_White_Siberian_Husky.jpg\"><img width=\"512\" alt=\"Pure White Siberian Husky","imageURL2":"/images/dogs/siberianhusky.jpg","function":"Sled","type":"Spitz","hypoallergenic":false,"shedding":"Average","exerciseIcon":"High","groomIcon":"Medium","__v":0,"longDesc":"According to the AKC Standard, the Siberian Husky \"does not display the possessive qualities of the guard dog, nor is he overly suspicious of strangers or aggressive with other dogs.\" Their exotic, wolf-like appearance makes Huskies appealing to many people, and their even temperament, love of other dogs and indifference to strangers makes them ideal family dogs. Huskies have a zest for life that is unmatched by few breeds. Every time a Husky is outside, it's as if it's his first time and well into adulthood Huskies play with the vigor of a puppy. They may seem like a good family dog for first time dog owners, but Huskies can often be “too much dog” for a novice. They require extensive training and exercise in order maintain good behavior and only those with the time and energy to fully commit to a Husky should take on this breed. But Husky owners agree, you get out of a Siberian Husky what you put into him, and these reliable dogs are worth the effort.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58f0e8ebcefc5b1678c630c4"},"Soft-coated Wheaten Terrier":{"_id":"58f0d5fd7decb434c07599c0","imageURL":"/images/dogs/wheaten.jpg","energyLevel":"Medium","size":"Medium","akcRank":50,"shortDesc":"Happy, friendly, and deeply devoted; just stubborn enough to remind you they’re terriers.","breedStandard":"https://www.akc.org/embeds/breed-standard/soft-coated-wheaten-terrier","grooming":"The Wheaten is single coated and sheds minimally, but needs regular grooming to keep its coat mat free.","exercise":"Somewhat Active; Wheatens who are kept indoors can become anxious and high strung. Daily walks and a few games of ball will meet his daily requirements, so this breed is adaptable to apartment life. They are sturdy little dogs, however, and can also accompany people on long hikes in the woods.","health":"Soft Coated Wheaten Terriers are generally a healthy breed with an average life span of 12 to 14 years.","club":"Soft Coated Wheaten Terrier Club of America","clubURL":"http://www.scwtca.org","breed":"Soft-coated Wheaten Terrier","imageURL2":"/images/dogs/wheaten2.jpg","function":"Herding","hypoallergenic":true,"shedding":"No","exerciseIcon":"Medium","groomIcon":"Medium","__v":0,"longDesc":"The Soft-coated Wheaten Terrier is an energetic and playful dog. It requires patience and consistent positive training. Harsh methods will often result in fear and/or aggression. A positive, even-handed approach works best with this intelligent yet headstrong terrier. It is an enthusiastic greeter, and will often jump up to lick a person's face, commonly referred to as the \"Wheaten greetin\". Wheatens are considered less scrappy than other terriers, but they can be hyper and more active than many other breeds. For this reason these dogs do best when they are exercised regularly. They are cool weather dogs and can become easily overheated in hot weather. If socialized with cats and puppies, they may get along fine with them; if not, care should be taken in introducing them to cats, as the breed has a very strong \"prey drive\" because of its vermin-hunting origin. Wheatens are extremely friendly and loving pets, and get along well with other dogs if properly socialized. Wheatens are very protective of their families and, although they may bark in alert at strangers, they rarely get aggressive. Many Wheaten owners thus say they make great watch dogs, but poor guard dogs. Wheatens are a great dog for kids and are generally friendly towards them.","bestOf":{"family":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run","id":"58f0d5fd7decb434c07599c0"},"Vizsla":{"_id":"58efecfc272b281a0cbf1f37","imageURL":"/images/dogs/vizsla.png","energyLevel":"High","size":"Medium","akcRank":31,"shortDesc":"Gentle, affectionate, energetic and eager.","breedStandard":"https://www.akc.org/embeds/breed-standard/vizsla","grooming":"Although he sheds, his short coat requires low daily maintenance.","exercise":"Very Active; Born hunting dogs built for long days in the field, Vizslas are athletes who thrive on hard exercise and love to be doing it with you. Vizslas who do not get enough activity quickly become neurotic and destructive.","health":"Vizslas are generally a healthy breed with an average lifespan of 9.15 years","club":"Vizsla Club of America, Inc.","clubURL":"http://www.vcaweb.org","breed":"Vizsla","imageURL2":"/images/dogs/vizsla2.jpg","function":"Hunting","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"Vizslas are very high energy, gentle-mannered, loyal, caring, and highly affectionate. They quickly form close bonds with their owners, children and even strangers. Often they are referred to as \"velcro\" dogs because of their loyalty and affection. Vizslas will cry or whine when they feel neglected or are otherwise unhappy. Some will bark at strangers if they feel that they are invading the \"pack\" space. They are very good guard dogs when trained.\nThey are natural hunters with an excellent ability to take training. Not only are they great pointers, but they are excellent retrievers as well. They will retrieve on land and in the water, making the most of their natural instincts. However, they must be trained gently and without harsh commands or strong physical correction, as they have sensitive temperaments and can be easily damaged if trained too harshly. However the owner must show quiet authority in training, otherwise the dog is likely to take over the training session.\nVizslas are excellent swimmers. Some may need a little motivation to get in the water but as they get used to it they will love it. Like all hunting dogs, Vizslas require a great deal of exercise to remain healthy and happy.\nThe Vizsla thrives on attention, exercise, and interaction. They are intelligent dogs and need a lot of mental stimulation when young. If left alone for long hours, they can be bored and destructive. With proper socialization and training, Vizslas are very gentle dogs that can be great around children. The Vizsla wants to be close to its owner as much as possible.","bestOf":{"active":true,"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"st","energyLevelClass":"mdi-run-fast","id":"58efecfc272b281a0cbf1f37"},"Weimaraner":{"_id":"58eff374272b281a0cbf1f3d","imageURL":"/images/dogs/weim.jpg","energyLevel":"High","size":"Medium","akcRank":34,"shortDesc":"Friendly, fearless, alert, obedient. And energetic..oh-so energetic.","breedStandard":"https://www.akc.org/embeds/breed-standard/weimaraner","grooming":"Grooming can be a wonderful bonding experience for you and your pet.","exercise":"Very Active; Weimaraners need at least one hour of vigorous exercise every day, but two is ideal. They are versatile dogs who enjoy walking, jogging, hiking and accompanying you on bike rides. Do not leave your Weimaraner in the back yard to entertain himself as he will probably destroy your yard and then try to escape.","health":"Weimaraners are generally a healthy breed with an average life span of 10 to 13 years.","club":"Weimaraner Club of America","clubURL":"http://weimaranerclubofamerica.org","breed":"Weimaraner","imageURL2":"/images/dogs/weim2.jpg","function":"Hunting","hypoallergenic":false,"shedding":"Low","exerciseIcon":"High","groomIcon":"Low","__v":0,"longDesc":"The Weimaraner is an energetic hunting dog, prized for its physical endurance and stamina, with a strong, instinctive prey-drive. It may tolerate cats but usually does not, tending to follow the urge to hunt—no matter how long it has known a particular cat—and likely to chase and kill any small animal that enters the garden. A Weimaraner requires frequent exercise and will appreciate games and play. An active owner is more likely to provide the vigorous exercise and games required. A Weimaraner requires appropriate training to learn how to be calm and control its behavior. The biggest reasons that these dogs become rowdy, hyper and destructive is lack of exercise. Though they are active and require a lot of outdoor time, Weimaraners expect to live indoors with the family and soak up as much affection as they can get. For outdoor oriented families who have experience with dogs, the Weimaraner can be an excellent companion. They have been made popular in recent years by William Wegman, who photographs Weimaraners in costumes and wigs, acting out scenes as if they were human.","bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"58eff374272b281a0cbf1f3d"},"English Cocker Spaniel":{"_id":"591df5d779e22940dcd1744a","imageURL":"https://upload.wikimedia.org/wikipedia/commons/0/02/English_Cocker_Spaniel_3.jpg","energyLevel":"Medium","size":"Medium","akcRank":56,"shortDesc":"Merry and responsive, alive with energy and a continuously wagging tail.","breedStandard":"https://www.akc.org/embeds/breed-standard/english-cocker-spaniel","grooming":"Their medium-long coat does take some care, including brushing and regular stripping or clipping. Their heavy coat can make them uncomfortable in hot climates.","exercise":"Somewhat Active; Upbeat outdoors, mellow indoors, ECs are happy to flush a bird or snooze at your feet.","health":"English Cocker Spaniels are generally a healthy breed with an average lifespan of 11 to 12 years. English cockers typically live a year longer than their American counterparts.","club":"English Cocker Spaniel Club of America, Inc.","clubURL":"http://www.ecsca.info/","breed":"English Cocker Spaniel","imageURL2":"/images/dogs/englishcocker.jpg","imageTitle":"By No machine-readable author provided. Akumiszcza assumed (based on copyright claims). [CC BY 3.0 (http://creativecommons.org/licenses/by/3.0) or GFDL (http://www.gnu.org/copyleft/fdl.html)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AEnglish_Cocker_Spaniel_3.jpg","function":"Hunting","hypoallergenic":false,"shedding":"Average","type":"Gun dog","exerciseIcon":"Medium","groomIcon":"High","longDesc":"Cockers are compassionate, determined, kind, intelligent, athletic, alert and resilient and make great family pets. The breed does not like being alone, and will bond strongly to an individual person in a family, usually the one who feeds it. Known for optimism, intelligence and adaptability, the breed is extremely loyal and affectionate. The English Cocker Spaniel has a cheerful nature. They rank 18th in Stanley Coren's The Intelligence of Dogs, being of excellent working/obedience intelligence. Due to the breed's happy disposition and continuously wagging tail, it has been given the nickname \"merry cocker.\" They can also be dominant but loyal to their companion.\nWith a good level of socialization at an early age, Cocker Spaniels can get along well with people, children, other dogs and other pets. This breed seems to have a perpetually wagging tail and prefers to be around people; it is not best suited to being alone in the backyard. Cockers can be easily stressed by loud noises and by rough treatment or handling. When trained with a soft hand and with lots of rewards, the Cocker Spaniel will be an obedient and loving companion with a happy, cheerful nature.","__v":0,"favClass":"paw fav-off","akcRankHeart":"Yellow","ordinal":"th","energyLevelClass":"mdi-run","id":"591df5d779e22940dcd1744a"},"English Springer Spaniel":{"_id":"591df9efb6fe1645c0621511","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/Male_English_Springer_Spaniel.JPG/512px-Male_English_Springer_Spaniel.JPG","energyLevel":"Medium","size":"Medium","akcRank":26,"shortDesc":"Friendly, playful, obedient at home; hardworking and steady in the field.","breedStandard":"https://www.akc.org/embeds/breed-standard/english-springer-spaniel","grooming":"English Springer Spaniels need regular brushing and trimming to keep their coats neat and free of mats.","exercise":"Very Active; Built for long days as hunters’ companions, need regular exercise for optimum mental and physical health.","health":"English Springer Spaniels are generally a healthy breed with a typical lifespan of 10.5 to 15 years.","club":"English Springer Spaniel Field Trial Association, Inc.","clubURL":"http://www.essfta.org","breed":"English Springer Spaniel","imageRef":"https://commons.wikimedia.org/wiki/File%3AMale_English_Springer_Spaniel.JPG\"><img width=\"512\" alt=\"Male English Springer Spaniel","imageTitle":"\"By Xandercary (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageURL2":"/images/dogs/englishspringer.png","function":"Sporting","type":"Gun dog","hypoallergenic":false,"shedding":"Average","longDesc":"The typical Spaniel is friendly, eager to please, quick to learn and willing to obey. In the right circumstances they can be an affectionate and easy-going family dog. Its alertness and attentiveness make it a good hunting companion. A typical Springer Spaniel will often choose one person in the family to be most loyal to and stick with that person as much as possible. The English Springer Spaniel ranks 13th in Stanley Coren's The Intelligence of Dogs, considered an excellent working dog. It has exceptional stamina and needs moderate amounts of activity, to focus its mind and to provide exercise, although this is different for each dog. Its long-legged build makes it among the fastest of the spaniels.\nIt is a sociable breed that enjoys the company of children and handles the company of other pets well. The hunting breed may not get along well with cats, however. If left alone for too long, they can become destructive and mischievous through boredom. They love the water, and tend to get wet whenever they have the chance.","exerciseIcon":"High","groomIcon":"Medium","__v":0,"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"th","energyLevelClass":"mdi-run","id":"591df9efb6fe1645c0621511"},"English Setter":{"_id":"591dfe2946ba0e2888da706a","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/English_Setter_running_through_grass.jpg/512px-English_Setter_running_through_grass.jpg","energyLevel":"Medium","size":"Medium","akcRank":102,"shortDesc":"Friendly, merry, and mellow; called the “gentleman of the dog world.”","breedStandard":"https://www.akc.org/embeds/breed-standard/english-setter","grooming":"Their beautiful, feathered coat requires regular maintenance, including brushing and clipping.","exercise":"Somewhat Active; Game and boisterous at play and work, a joy to live with at home.","health":"English Setters are generally a healthy breed. Life expectancy is between 11 and 12 years, though 13 to 15 years is not uncommon.","club":"English Setter Association of America, Inc.","clubURL":"http://www.esaa.com","breed":"English Setter","imageTitle":"By Rjgunn007 [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AEnglish_Setter_running_through_grass.jpg","imageURL2":"/images/dogs/englishsetter.jpg","function":"Hunting","type":"Gun dog","hypoallergenic":false,"shedding":"Average","exerciseIcon":"Medium","groomIcon":"Medium","longDesc":"This breed's standard temperament is best described as a \"Gentleman by Nature.\" However, it can also be strong-willed and mischievous, especially if coming from working/field breeding lines. English Setters are energetic, people-oriented dogs, that are well suited to families who can give them attention and activity, or to working with a hunter, where they have a job to do. They are active dogs that need plenty of exercise and up to two hours a day of exercise is recommended. Inside they tend to be lower energy and love to be couch potatoes and lap dogs; the breed is described as \"intensely friendly,\" \"good natured,\" and \"adores visitors and is particularly happy with children.\"\nThey rank 37th in Stanley Coren's The Intelligence of Dogs, being of above average working/obedience intelligence. English Setters are very intelligent and can be trained to perform about any task another breed can do, with the exception of herding. However, they are not always easy to train, as their natural bird instinct tends to distract them in outdoor environments. Their temperament is considered to be gentle and as English Setters can be very sensitive to criticism, positive reinforcement training methods using treats and praise work best when undertaking basic training.","__v":0,"favClass":"paw fav-off","akcRankHeart":"Green","ordinal":"nd","energyLevelClass":"mdi-run","id":"591dfe2946ba0e2888da706a"},"Field Spaniel":{"_id":"591e017746ba0e2888da706b","imageURL":"/images/dogs/fieldspaniel.jpg","energyLevel":"Medium","size":"Medium","akcRank":147,"shortDesc":"Sweet, sensitive, fun-loving, and smart; a real people-pleaser.","breedStandard":"https://www.akc.org/embeds/breed-standard/field-spaniel","grooming":"The Field Spaniel has a medium-length coat (less than other Spaniel breeds) which makes grooming fairly easy. They also don't have the typical undercoat that many spaniels have. Field Spaniels will still require occasional trimming.","exercise":"Somewhat Active; Tranquil around the house but vigorous and game for anything when at play. They love the outdoors and are at their happiest when involved in family activities such as swimming, hiking, biking and hunting.","health":"Field Spaniels are generally a healthy breed. The median lifespan for the breed was found to be eleven years and eight months, which is five months higher than the median age for all dog breeds.","club":"Field Spaniel Society of America","clubURL":"http://www.fieldspaniels.org","breed":"Field Spaniel","imageRef":"","imageTitle":"","function":"Hunting","type":"Gun dog","longDesc":"The Field Spaniel can be a good family dog while it has a job to do. They are suitable for dog agility and hunting. Without some sort of purpose, the dog can often try to amuse itself and cause mischief. However, they are patient with children and like to stay close to their family. When socialized, they are good with other dogs They are generally docile and independent, and are not as excitable as Cocker Spaniels. Stanley Coren's The Intelligence of Dogs lists the breed as being above average in working intelligence. Larger than a Cocker Spaniel and smaller than a Springer Spaniel, the Field Spaniel is a medium-sized bundle of energy. They love water and have a reputation for creating quite a mess with their water dish, splashing around as if it is a tiny wading pool. Their temperament, trainability and patience with children makes Field Spaniels an excellent choice for a first time dog owner, if that person is committed to an active lifestyle.","groomIcon":"Medium","exerciseIcon":"Medium","hypoallergenic":false,"shedding":"Average","imageURL2":"/images/dogs/fieldspaniel.jpg","__v":0,"bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Green","ordinal":"th","energyLevelClass":"mdi-run","id":"591e017746ba0e2888da706b"},"Flat-coated Retriever":{"_id":"591e031146ba0e2888da706c","imageURL":"/images/dogs/flatretriever.jpg","energyLevel":"High","size":"Large","akcRank":89,"shortDesc":"Happy, confident, intelligent, and forever young.","breedStandard":"https://www.akc.org/embeds/breed-standard/flat-coated-retriever","grooming":"Among Sporting breeds, the Flat-Coat is easy to maintain, needing only occasional brushing and bathing.","exercise":"Very Active; Highly energetic gundogs, Flat-Coats need lots of outdoorsy exercise.","health":"Flat-Coated Retrievers are generally a healthy breed with an average life span of eight years. Flat-Coated Retrievers have a very low rate of hip dysplasia and luxating patellas compared to other medium-sized breeds, but a higher risk of cancer than most other dogs.","club":"Flat-Coated Retriever Society of America, Inc.","clubURL":"http://www.fcrsainc.org","breed":"Flat-coated Retriever","imageURL2":"/images/dogs/flatretriever2.jpg","function":"Hunting","type":"Retriever","hypoallergenic":false,"shedding":"Average","exerciseIcon":"High","groomIcon":"Medium","longDesc":"The Flat-Coated Retriever is an active, multi-talented bird dog with a strong desire to please people. Exuberant, confident, and outgoing, they make a loving family pet and can be companions to small children, provided adults are nearby to direct this dog's boisterous enthusiasm. These retrievers require plenty of exercise and engagement to help channel their natural sporting energy.[citation needed] While they will protect their owners and property with an assertive bark, they are unlikely to back up such noise with actual aggression. Because of their excellent sense of smell, combined with their boundless energy and eagerness to please their masters, they are sometimes used as drug-sniffer dogs. They are used in the breeding program for The Guide Dogs for the Blind Association in the UK, both as a breed and as cross-breeds with the Labrador Retriever.\nEager and quick to learn, they are best trained in short intervals, as they may bore with repetition. This breed retains its youthful, puppy-like outlook and demeanor well into old age. Paddy Petch, author of The Complete Flat-Coated Retriever, refers to these dogs as the \"Peter Pan\" of the retriever breeds, given they never quite grow up.","__v":0,"bestOf":{"active":true},"favClass":"paw fav-off","akcRankHeart":"Orange","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"591e031146ba0e2888da706c"},"French Bulldog":{"_id":"591e055246ba0e2888da706d","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/df/French_bulldog_on_the_grass.jpg/512px-French_bulldog_on_the_grass.jpg","energyLevel":"Medium","size":"Small","akcRank":6,"shortDesc":"Playful, smart, adaptable, and completely irresistible.","breedStandard":"https://www.akc.org/embeds/breed-standard/french-bulldog","grooming":"The Frenchie requires minimal grooming.A bath and nail trim every now and then will suffice.","exercise":"Not Very Active; Frenchies are easygoing, not terribly athletic; brisk walks will keep them trim.","health":"As a result of the compacted airway and the bulk of the French bulldog, they have an inability to effectively regulate their body temperature. While a regular canine may suffer to some degree from the heat, to a Frenchie it may be lethal. It is imperative that they be protected from temperature extremes at all times, and that they always have access to fresh water and shade. Some airlines will not let Frenchies fly due to their breathing issues when stressed.","club":"French Bulldog Club of America","clubURL":"http://www.fbdca.org","breed":"French Bulldog","imageTitle":"By Artur Malinowski (Flickr: SDIM5501) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AFrench_bulldog_on_the_grass.jpg","imageURL2":"/images/dogs/frenchbulldog.jpg","function":"Companion","hypoallergenic":false,"shedding":"Low","exerciseIcon":"Low","groomIcon":"Low","longDesc":"The French Bulldog requires close contact with humans. As a result, they should not be left alone for more than a few hours because these dogs suffer from separation anxiety. This is especially important when French Bulldogs are young, but this issue remains a concern into adulthood. Being alone for too long can cause a French Bulldog to behave in a destructive manner, which can include chewing on household items or furniture or even going to the bathroom in the house.\nThey have fairly minimal exercise needs, but do require at least daily short walks. The French Bulldog is sometimes called \"Frog dog\" or a \"Clown dog\". Frog dog is in reference to the unique way they sit with hind legs spread out. Clown dog is because they are known to be fun loving vivacious \"clowns of the dog world.\" Their calm nature makes them an excellent choice for apartment dwellers, as does their sensible attitude towards barking.\nTheir bulk and their compromised breathing system makes it impossible for them to regulate their temperature efficiently. The French bulldog has only a single short coat. What this all means for the dog is that it becomes cold very easily. Also, they will very likely need to have some extra covering inside during the winter if you live in a particularly cold area. These dogs need warm clothing when out in cold weather. Precautions must be taken when exercising during hot or humid weather, as they are prone to heat stroke. It is also recommended that French Bulldogs who live indoors have access to air conditioning to regulate their temperature, provided the air conditioning is not set too low.\nThis breed is patient and affectionate with its owners, especially with children, who are especially protected by the females. French Bulldogs can easily live with other breeds when the proper introductions are done.","__v":0,"bestOf":{"apartment":true,"quiet":true,"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run","id":"591e055246ba0e2888da706d"},"Havanese":{"_id":"591f07fca574523df8e17750","imageURL":"https://upload.wikimedia.org/wikipedia/commons/b/b4/Havanese0315.jpg","energyLevel":"Medium","size":"Small","akcRank":23,"shortDesc":"Outgoing, funny, & intelligent.","breedStandard":"https://www.akc.org/embeds/breed-standard/havanese","grooming":"The Havanese's non-shedding coat makes it suitable for allergy sufferers, but regular grooming is necessary. Because of the tropical nature of the Havanese, the fine and lightweight coat is designed to act as a sunshade and cooling agent on hot days. This means that, though the coat is abundant and may appear warm, the Havanese must be protected from the cold. These dogs become cold very easily so keeping their coat longer in winter time is essential, especially since these dogs originate from hot weather.","exercise":"Somewhat Active; Curious, sociable dogs, Havanese enjoy a good romp but have no special exercise needs.","health":"Havanese are generally a healthy breed with an average life span of 14 to 16 years.","club":"Havanese Club of America","clubURL":"http://www.havanese.org","breed":"Havanese","imageTitle":"\"By ScottM0312 (Uploaded by ScottM0312 at the English Wikipedia) [Public domain], via Wikimedia Commons","imageRef":"\"https://commons.wikimedia.org/wiki/File%3AHavanese0315.jpg\"><img width=\"512\" alt=\"Havanese0315","imageURL2":"/images/dogs/havanese.jpg","function":"Companion","type":"Bichon","hypoallergenic":true,"shedding":"No","exerciseIcon":"Low","groomIcon":"High","longDesc":"The Havanese is a toy dog. It is smart and can be easily trained. It is best to train this dog at a young age, because some habits will stick as they become older. However, training these dogs while they are older is still possible. Like many toy breeds, the Havanese can be difficult to housebreak. However, Havanese can be trained to use a litter box, which can greatly reduce issues with housebreaking. This breed is very smart and can be house trained faster than most toy dogs. The Havanese get very attached and are very loyal to their owners, and often attach to one person which they will closely follow. As a result, the Havanese does not do well in a household where it will be left alone all day. Although the Havanese is an active and lively dog, they are small enough that many of their exercise needs can be met in a house or yard, and therefore they do not require as much vigorous exercise as other breeds may. However, exercise is still necessary for this breed to be happy and healthy.\nThe Havanese is satisfied when their owner is satisfied. They are very friendly dogs, and do not typically bark at strangers, but some individuals are more shy than others. The Havanese has a great personality and temperament, and loves to play outside and be around people. They are not a dog that can live exclusively outside and prefer being inside with their owner. They love to perform in front of others and have a great need for affection. This breed is not afraid to show affection and loves getting attention. They manage well with people of all ages and can thrive in any size home.","__v":0,"bestOf":{"apartment":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"rd","energyLevelClass":"mdi-run","id":"591f07fca574523df8e17750"},"Irish Setter":{"_id":"591f10ceb924b83fe4db2de6","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Irish_Setter_in_Tallinn.JPG/512px-Irish_Setter_in_Tallinn.JPG","energyLevel":"High","size":"Large","akcRank":76,"shortDesc":"Outgoing, sweet-natured, active, and trainable.","breedStandard":"https://www.akc.org/embeds/breed-standard/irish-setter","grooming":"The breed's coat needs little maintenance beyond regular weekly grooming with a brush, trimming and the occasional bath.","exercise":"The Irish Setter is an athlete and as such requires regular exercise. A lack of activity can lead to destructive behavior and/or hyperactivity. They will require long walks daily and off-lead running after they have been trained to come when called.","health":"Irish Setters are generally a healthy breed.","club":"Irish Setter Club of America, Inc.","clubURL":"http://www.irishsetterclub.org","breed":"Irish Setter","imageTitle":"By Томасина (Own work) [CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AIrish_Setter_in_Tallinn.JPG","imageURL2":"/images/dogs/irishsetter.jpg","function":"Hunting","type":"Gun dog","hypoallergenic":false,"shedding":"Average","longDesc":"Irish Setters get along well with children, other dogs, and will enthusiastically greet visitors. Even though they do well with household pets, small animals may pose a problem for this breed, as they are a hunting breed. Some Irish Setters may have problems with cats in the house, and may be too rambunctious with small children. As the FCI, ANKC and UK Standards state, the breed should be \"demonstrably affectionate.\" As a result, Irish Setters make excellent companion animals and family pets.\nIrish Setters are an active breed, and require long, daily walks and off-lead running in wide, open spaces. They are, however, a breed with a tendency to 'play deaf,' so careful training on mastering the recall should be undertaken before allowing them off-lead.\nIrish Setters enjoy having a job to do. Lack of activity will lead to a bored, destructive, or even hyperactive dog. This is not a breed that can be left alone in the backyard for long periods of time, nor should they be. Irish Setters thrive on constant human companionship. Irish Setters respond swiftly to positive training and are highly intelligent. \nThough they are usually alert to their surroundings, Irish Setters are not well-suited as guard dogs, as they are not a naturally assertive breed. \nThe Irish Setter was bred for hunting, specifically for setting or locating and pointing upland gamebirds. They are a tireless, wide-ranging hunter, and well-suited to fields and wet or dry moorland terrain. Using their excellent sense of smell to locate the mark (or bird), the Irish Setter will then hold a pointing position, indicating the direction in which the bird lies hidden.\nIrish Setters are also widely used as therapy dogs in schools and hospitals.","exerciseIcon":"High","groomIcon":"Medium","__v":0,"favClass":"paw fav-off","akcRankHeart":"Orange","ordinal":"th","energyLevelClass":"mdi-run-fast","id":"591f10ceb924b83fe4db2de6"},"Italian Greyhound":{"_id":"591f162f1d34fe04a06631b5","breed":"Italian Greyhound","imageTitle":"By christina (Flickr) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AItalian_Greyhound_standing_gray.jpg\"><img width=\"512\" alt=\"Italian Greyhound standing gray","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Italian_Greyhound_standing_gray.jpg/512px-Italian_Greyhound_standing_gray.jpg","imageURL2":"/images/dogs/italiangreyhound.jpg","function":"Companion","type":"Toy","size":"Small","energyLevel":"High","hypoallergenic":false,"shedding":"Low","longDesc":"The Italian Greyhound makes a good companion dog and enjoys the company of people. However, the breed's slim build and short coat make them somewhat fragile, and injury can result from rough or careless play with children. The breed is good with the elderly or a couple without any children for it prefers a quiet household but they are also generally fine with older children. They also are equally at home in the city or the country, although they tend to do best in spacious areas. They are fast, agile and athletic. Like any dog, daily exercise is a must for a happier, well-adjusted pet. Italian greyhounds love to run. The young dog is often particularly active, and this high level of activity may lead them to attempt ill-advised feats of athleticism that can result in injury. Due to their size, and in some lineages poor bone density, they are prone to broken legs. Italian Greyhounds make reasonably good watchdogs, as they bark at unfamiliar sounds. They may also bark at passers-by and other animals. However, they should not be considered \"true\" guard dogs as they are often aloof with strangers and easily spooked to run.\nAs gazehounds, Italian Greyhounds instinctively hunt by sight and have an extremely high predator drive. Owners of Italian Greyhounds should typically keep their dogs leashed at all times when not in an enclosed area. Because of their slender heads, a break-away martingale collar is suggested.\nSome Italian Greyhounds enjoy dog agility. The breed's lithe body and its love of action provide potential to do well at this sport, although their natural inclination is for straight-out racing rather than for working tightly as a team with a handler on a technical course.\nLure coursing is well-fitted to the Italian Greyhound, and they seem to enjoy it tremendously. Although the Italian Greyhound is a very fast dog, it is not as well suited to racing as its larger cousin.","health":"Italian greyhounds are a healthy breed with an average life span of 13.5 years. Some lineages are prone to poor bone density, making them prone to broken legs. The breed's slim size and short coat can make them somewhat fragile, and injury may result with rough or careless play with children.","grooming":"Dogs of this breed have an extremely short and almost odorless coat that requires little more than an occasional bath about once a month, though many veterinarians suggest that even bathing one per month is too frequent for this breed.","groomIcon":"Low","exerciseIcon":"High","exercise":"The young Italian greyhound is particularly active, so daily walks are a must. They are built for speed and do well in agility or dog relay races.","shortDesc":"Smallest of the sighthounds; Active and built for speed.","breedStandard":"https://www.akc.org/embeds/breed-standard/italian-greyhound\","club":"Italian Greyhound Club of America","clubURL":"http://italiangreyhound.org/","__v":0,"bestOf":{"lowMaintenance":true},"favClass":"paw fav-off","akcRankHeart":"Blank","ordinal":"","energyLevelClass":"mdi-run-fast","id":"591f162f1d34fe04a06631b5"},"Maltese":{"_id":"591f1fe69cc23002d0a8f4b6","imageURL":"/images/dogs/maltese.jpg","energyLevel":"Medium","size":"Small","akcRank":33,"shortDesc":"Gentle, playful, affectionate; fearless in a charming toy-dog way.","breedStandard":"https://www.akc.org/embeds/breed-standard/maltese","grooming":"Maltese should be brushed daily, and groomed often to prevent mats from forming in their long, white coat. A short pet trim is adorable on this breed as well, but in colder months they may need a coat.","exercise":"Somewhat Active; A classic lapdog, but Maltese still like brisk walks, playtime, and learning tricks.","health":"Maltese are generally a healthy breed and not commonly afflicted with serious disease. They are among the longest-living dogs with an average life span of 15 years.","club":"American Maltese Association, Inc.","clubURL":"http://www.americanmaltese.org","breed":"Maltese","imageURL2":"/images/dogs/maltese2.jpg","function":"Companion","type":"Bichon","hypoallergenic":true,"shedding":"No","exerciseIcon":"Medium","groomIcon":"High","longDesc":"Maltese are bred to be companion dogs. They are extremely lively and playful, and even as a Maltese ages, their energy level and playful demeanor remain fairly constant. Some Maltese may occasionally be snappish with smaller children and should be supervised when playing, although socializing them at a young age will reduce this habit. They also adore humans, and prefer to stay near them. The Maltese is very active within a house, and, preferring enclosed spaces, does very well with small yards. For this reason, the breed also fares well in apartments and townhouses, and is a prized pet of urban dwellers. Some Maltese may suffer from separation anxiety.\nAn Australia-wide (not including Tasmania) research project carried out in conjunction with RSPCA found owners likely to dump their Maltese. citing the tendency of Maltese to bark constantly. This breed is Australia's most dumped dog. In addition, figures released in 2010 by the Korean National Veterinary Research and Quarantine Service show that some 1,208 Maltese were abandoned between January and August 2010, making it the most abandoned breed in Seoul, South Korea.","__v":0,"bestOf":{"apartment":true},"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"rd","energyLevelClass":"mdi-run","id":"591f1fe69cc23002d0a8f4b6"},"West Highland White Terrier":{"_id":"591f26daf91ed3232ce70e47","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Simon_ciel_2.jpg/512px-Simon_ciel_2.jpg","energyLevel":"Medium","size":"Small","akcRank":41,"shortDesc":"Happy, smart, loyal, entertaining. Once bred to hunt rodents.","breedStandard":"https://www.akc.org/embeds/breed-standard/west-highland-white-terrier","grooming":"They have a soft, dense, thick undercoat and a rough outer coat, which can grow to about 2 inches (5.1 cm) long. The fur fills out the face to give a rounded appearance. As puppies develop into adults, their coarse outer coat is normally removed by either hand-stripping, especially for dog-showing, or otherwise clipping.","exercise":"Very Active; true terriers, Westies are quick, curious, and lively.","health":"West Highland White Terriers are generally a healthy breeed, enjoying a life span between 12 and 16 years. The breed is prone to skin disorders.","club":"West Highland White Terrier Club of America","clubURL":"http://www.westieclubamerica.com/","breed":"West Highland White Terrier","imageTitle":"By User: Bruno ILHAT (Own work) [GFDL (http://www.gnu.org/copyleft/fdl.html) or CC BY-SA 3.0 (http://creativecommons.org/licenses/by-sa/3.0)], via Wikimedia Commons","imageRef":"\"https://commons.wikimedia.org/wiki/File%3ASimon_ciel_2.jpg","imageURL2":"/images/dogs/westhighland.jpg","function":"Companion","type":"Terrier","hypoallergenic":false,"shedding":"Average","exerciseIcon":"High","groomIcon":"Medium","longDesc":"The temperament of the West Highland White Terrier can vary greatly, with some being friendly towards children, whilst others prefer solitude. It will not tolerate rough handling such as a child pulling on its ears, and can be both food- and toy-possessive. It is normally independent, assured, and self-confident, and can make a good watchdog. It is a loyal breed that bonds with its owner, but is often always on the move, requiring good exercise (15–30 min). The Westie is highly social and is the most friendly and jolly of all the Scottish breeds of terriers.\nIt is a hardy breed, and can be stubborn, leading to issues with training. A Westie may need to have its training refreshed on occasion during its lifetime. Having a typical terrier prey drive, it tends to be highly interested in toys, especially chasing balls. It does retain the instincts of an earth-dog, including inquisitive and investigative traits, as well as natural instincts to both bark and dig holes.","__v":0,"favClass":"paw fav-off","akcRankHeart":"Pink","ordinal":"st","energyLevelClass":"mdi-run","id":"591f26daf91ed3232ce70e47"},"Cavalier King Charles Spaniel":{"_id":"591f2ad7750365182c6234fd","breed":"Cavalier King Charles Spaniel","imageTitle":"By Mário Simoes (Flickr: Cavalier King Charles Spaniel) [CC BY 2.0 (http://creativecommons.org/licenses/by/2.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3ACavalier_King_Charles_Spaniel_at_repose.jpg","imageURL":"https://upload.wikimedia.org/wikipedia/commons/thumb/7/77/Cavalier_King_Charles_Spaniel_at_repose.jpg/512px-Cavalier_King_Charles_Spaniel_at_repose.jpg","imageURL2":"/images/dogs/cavalier.jpg","function":"Companion","type":"Spaniel","size":"Small","energyLevel":"Low","hypoallergenic":false,"shedding":"Average","exerciseIcon":"Low","longDesc":"The breed is highly affectionate, playful, extremely patient and eager to please. As such, dogs of the breed are good with children and other dogs. Cavaliers are not shy about socializing with much larger dogs. They will adapt quickly to almost any environment, family, and location and suit city and country life. Their ability to bond with larger and smaller dogs makes them ideal in houses with more than one breed of dog as long as the other dog is trained. Cavaliers are naturally curious and playful, but also enjoy simply cuddling up on a cushion or lap, making them excellent companion or lap dogs for medical patients and the elderly.\nCavaliers are active and sporting. Cavaliers are successful in conformation shows, obedience and agility and they also make wonderful therapy dogs due to their sweet, gentle natures. \nThey have an instinct to chase most things that move including vehicles on busy streets, and so most Cavaliers will never become street-wise. As they tend to regard all strangers as friends, members of the breed will usually not make good guard dogs. Spaniels have a strong hunting instinct and may endanger birds and small animals. However, owners have reported that through training their Cavaliers live happily with a variety of small animals including hamsters and gerbils.","exercise":"The breed is adaptable in their need for exercise, happy with either sleeping on the couch or taking long walks.","grooming":"The Cavaliers coat requires weekly brushing to stay snarl-free. Although promoted as a no-trim dog, most owners prefer to trim their cavaliers on a regular basis, particularly the long hair on their feet, which can track in dirt and make walking difficult if left to grow long.","groomIcon":"Medium","health":"Cavaliers can notably suffer from mitral valve disease, which leads to heart failure. Typical life span is under ten years.","shortDesc":"Affectionate, graceful and gentle. Great with children.","breedStandard":"https://www.akc.org/embeds/breed-standard/cavalier-king-charles-spaniel\","club":"American Cavalier King Charles Spaniel Club","clubURL":"http://www.ackcsc.org/","__v":0,"bestOf":{"apartment":true,"quiet":true},"favClass":"paw fav-off","akcRankHeart":"Blank","ordinal":"","energyLevelClass":"mdi-walk","id":"591f2ad7750365182c6234fd"},"Yorkshire Terrier":{"_id":"591f2ea6750365182c6234fe","imageURL":"https://upload.wikimedia.org/wikipedia/commons/1/1c/Yorkshire_Terrier-AP-1DBZN3-590lc121913.jpg","energyLevel":"Medium","size":"Small","akcRank":9,"shortDesc":"Sprightly, tomboyish, and affectionate. Alert and intelligent.","breedStandard":"https://www.akc.org/embeds/breed-standard/yorkshire-terrier","grooming":"The beautiful long coat of the Yorkie requires regular brushing. For adult Yorkshire Terriers, their hair should be glossy, fine, straight, and silky. Traditionally the coat is grown out very long and is parted down the middle of the back, but this breed looks adorable in a cute pet trim as well.","exercise":"Somewhat Active; Yorkies are moderately active and will be happy with a daily satisfying walk.","health":"Yorkshire Terriers are generally a healthy breed with a life span of 13 to 20 years. Like many toy breeds, they are prone to severe dental disorders. Frequent toothbrushing is recommended, as well as professional teeth cleaning by a veterinarian, to prevent dental decay, which can lead to other health issues.","club":"Yorkshire Terrier Club of America, Inc.","clubURL":"http://theyorkshireterrierclubofamerica.org","breed":"Yorkshire Terrier","imageTitle":"By CaterineH (Own work) [CC BY-SA 4.0 (http://creativecommons.org/licenses/by-sa/4.0)], via Wikimedia Commons","imageRef":"https://commons.wikimedia.org/wiki/File%3AYorkshire_Terrier-AP-1DBZN3-590lc121913.jpg","imageURL2":"/images/dogs/yorkie.jpg","function":"Companion","type":"Toy","hypoallergenic":true,"shedding":"No","groomIcon":"High","exerciseIcon":"Medium","longDesc":"Though small, the Yorkshire Terrier is active, very overprotective, curious, and fond of attention. Mentally sound and emotionally secure ones should normally not show the soft submissive temperament seen in lap dogs although many exhibit this behavior due to improper training. Because of this, it is advised that a Yorkie would not be suitable for a home with young children. Instead, they make ideal companions for older families with many more reputable breeders routinely only homing to families with children older than 8 years for the comfort of the dog, but more so for the benefit of the child.\nYorkshire Terriers are an easy dog breed to train. This results from their own nature to work without human assistance. They are naturally smart and quick to learn with many being food and or praise motivated. Because they were developed as a working breed many need a lot of both physical and mental stimulation—with both long walks/runs but also indoor games and training to keep their mind busy. They are known for being yappy, but many have reported that a contented Yorkie is a quiet one—that will happily curl up on your knee in the evening. Yorkies are easily adaptable to all surroundings, travel well and make suitable pets for many homes. Due to their small size, they require limited exercise but need daily interaction with people. They thrive on attention and love. Many, however, are timid around other dogs and prefer to stay close to their humans for comfort.\nYorkshire Terriers do tend to bark a lot. This makes them excellent watchdogs as they will sound the alarm when anyone gets close. However, this barking problem can be resolved with proper training and exercise.","__v":0,"bestOf":{"apartment":true},"favClass":"paw fav-off","akcRankHeart":"Red","ordinal":"th","energyLevelClass":"mdi-run","id":"591f2ea6750365182c6234fe"}}}